{
  "Renderer.FilterBackground": {
    "en": {
      "display_name": "Filter Background",
      "description": "Smooths and filters background when rendering or compositing.",
      "help_text": "Applies anti-aliasing to the background layer, reducing edge artifacts when compositing renders over transparent backgrounds. Recommended for final output rendering."
    },
    "ru": {
      "display_name": "Фильтрация фона",
      "description": "Сглаживает и фильтрует фон при рендере или композите.",
      "help_text": "Применяет сглаживание к фоновому слою, уменьшая артефакты по краям при композите рендеров с прозрачностью. Рекомендуется для финальных рендеров."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "1"
  },
  "Renderer.UseEnvironAlpha": {
    "en": {
      "display_name": "Use Environment Alpha",
      "description": "Enables transparency in environment background during rendering.",
      "help_text": "Use this to output transparent background from environment maps for compositing. Disable when using solid color backgrounds."
    },
    "ru": {
      "display_name": "Использовать альфа-канал окружения",
      "description": "Включает прозрачность в фоне окружения при рендере.",
      "help_text": "Используйте для вывода прозрачного фона из карты окружения при композите. Отключите, если используете сплошной цвет фона."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "1"
  },
  "Renderer.AlphaOutOnAdditive": {
    "en": {
      "display_name": "Alpha Output on Additive Layers",
      "description": "Defines how alpha channels are written when additive blending is used.",
      "help_text": "Controls alpha compositing of additive light passes. Set to 1 for correct blending in multi-layered compositing setups."
    },
    "ru": {
      "display_name": "Альфа при аддитивном слое",
      "description": "Определяет, как записывается альфа-канал при аддитивном смешивании.",
      "help_text": "Контролирует альфа-композитинг аддитивных световых проходов. Установите 1 для корректного смешивания в многослойных композитах."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "1"
  },
  "Renderer.OpenOnError": {
    "en": {
      "display_name": "Open Render Dialog on Error",
      "description": "Shows the Render Setup dialog automatically when a render error occurs.",
      "help_text": "Useful for debugging failed renders. Leave disabled for automated rendering pipelines to avoid interruptions."
    },
    "ru": {
      "display_name": "Открывать Render Setup при ошибке",
      "description": "Автоматически открывает окно Render Setup при ошибке рендера.",
      "help_text": "Полезно для отладки неудачных рендеров. Оставляйте выключенным для автоматических пайплайнов, чтобы избежать прерываний."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  },
  "Renderer.HDAOEnabled": {
    "en": {
      "display_name": "Render Ambient Occlusion (HDAO)",
      "description": "Applies ambient occlusion in rendered images for added realism.",
      "help_text": "Adds subtle shadowing between objects to improve perceived depth. Use with care in scenes with baked lighting or AO passes."
    },
    "ru": {
      "display_name": "Окклюзия окружения в рендере (HDAO)",
      "description": "Добавляет эффект окклюзии окружения для повышения реализма.",
      "help_text": "Добавляет мягкие тени между объектами, улучшая восприятие глубины. Используйте с осторожностью в сценах с запечённым освещением или отдельными AO-проходами."
    },
    "type": "boolean",
    "default": "1",
    "recommended": "1"
  },
  "OpenImageIO.max_open_files": {
    "en": {
      "display_name": "Max Open Files",
      "description": "Sets the maximum number of texture files OpenImageIO can keep open simultaneously.",
      "help_text": "Higher values improve performance with many small textures but increase memory consumption. Recommended between 50–200 depending on scene size."
    },
    "ru": {
      "display_name": "Максимум открытых файлов",
      "description": "Задает максимальное число файлов текстур, открытых одновременно через OpenImageIO.",
      "help_text": "Большее значение повышает производительность при множестве мелких текстур, но увеличивает потребление памяти. Рекомендуется 50–200 в зависимости от размера сцены."
    },
    "type": "integer",
    "default": "100",
    "recommended": "100"
  },
  "OpenImageIO.max_memory_MB": {
    "en": {
      "display_name": "Max Memory (MB)",
      "description": "Defines the maximum memory (in MB) OpenImageIO may use for texture caching.",
      "help_text": "Limits how much RAM OpenImageIO allocates for image caching. Set according to system memory; 4096–16384 MB works for most modern machines."
    },
    "ru": {
      "display_name": "Максимум памяти (МБ)",
      "description": "Определяет максимальный объём памяти (в МБ), используемый OpenImageIO для кэширования текстур.",
      "help_text": "Ограничивает использование оперативной памяти для кэширования изображений. Настройте по объёму вашей системы; 4096–16384 МБ подходит для большинства современных машин."
    },
    "type": "float",
    "default": "16384.0",
    "recommended": "8192.0"
  },
  "OpenImageIO.autotile": {
    "en": {
      "display_name": "Auto Tile Textures",
      "description": "Enables automatic subdivision of large textures into tiles.",
      "help_text": "Improves texture streaming performance for large bitmaps by splitting them into smaller tiles in memory. Recommended for large scenes or UDIM setups."
    },
    "ru": {
      "display_name": "Автоматическое разбиение текстур",
      "description": "Включает автоматическое деление больших текстур на тайлы.",
      "help_text": "Повышает производительность потоковой загрузки больших карт, разделяя их на более мелкие участки в памяти. Рекомендуется для больших сцен или UDIM-текстур."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "1"
  },
  "OpenImageIO.automip": {
    "en": {
      "display_name": "Auto Generate Mipmaps",
      "description": "Automatically generates mipmaps for loaded textures if missing.",
      "help_text": "Generates downscaled versions of textures for distant objects, improving performance and reducing aliasing. Recommended to keep enabled."
    },
    "ru": {
      "display_name": "Автоматическая генерация мип-карт",
      "description": "Автоматически создаёт мип-карты для загруженных текстур при их отсутствии.",
      "help_text": "Создаёт уменьшенные версии текстур для дальних объектов, повышая производительность и снижая ступенчатость. Рекомендуется держать включённым."
    },
    "type": "boolean",
    "default": "1",
    "recommended": "1"
  },
  "OpenImageIO.autoscanline": {
    "en": {
      "display_name": "Force Scanline Mode",
      "description": "Forces sequential texture reading mode for low-memory systems.",
      "help_text": "Reads texture data line-by-line instead of full caching. Use on very limited systems or for network streaming of heavy textures."
    },
    "ru": {
      "display_name": "Режим построчного чтения",
      "description": "Принудительно включает последовательное чтение текстур для систем с малым объёмом памяти.",
      "help_text": "Считывает данные текстур построчно вместо полного кэширования. Используйте на слабых системах или при потоковой загрузке тяжёлых карт по сети."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  },
  "OpenImageIO.autoFileUpdate": {
    "en": {
      "display_name": "Auto File Update",
      "description": "Automatically reloads modified texture files during session.",
      "help_text": "Detects changes in texture source files and updates them in viewport and render without manual reload. Useful for live texturing workflows."
    },
    "ru": {
      "display_name": "Автоматическое обновление файлов",
      "description": "Автоматически перезагружает изменённые файлы текстур в ходе сессии.",
      "help_text": "Отслеживает изменения исходных файлов текстур и обновляет их во вьюпорте и рендере без ручной перезагрузки. Полезно для интерактивных пайплайнов текстурирования."
    },
    "type": "boolean",
    "default": "1",
    "recommended": "1"
  },
  "MAXScript.LoadSavePersistentGlobals": {
    "en": {
      "display_name": "Persist Global Variables",
      "description": "Saves and restores global MAXScript variables between sessions.",
      "help_text": "Stores variables created in MAXScript across restarts. Useful for persistent tool data, but may cause conflicts if different scripts reuse variable names."
    },
    "ru": {
      "display_name": "Сохранять глобальные переменные",
      "description": "Сохраняет и восстанавливает глобальные переменные MAXScript между сессиями.",
      "help_text": "Сохраняет глобальные переменные MAXScript между запусками программы. Полезно для постоянных данных инструментов, но может вызывать конфликты при переиспользовании имён переменных."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  }
}
