{
  "SafeSceneScriptExecutionEnabled": {
    "en": {
      "display_name": "Safe Scene Script Execution",
      "description": "Enables sandbox mode for scripts embedded in scenes to block unsafe commands.",
      "help_text": "When enabled, embedded MAXScript, Python or .NET commands in scene files are restricted. Recommended in production environments; disable only for trusted debugging scenarios."
    },
    "ru": {
      "display_name": "Безопасное выполнение скриптов сцены",
      "description": "Включает песочницу для скриптов, встроенных в сцену, блокируя опасные команды.",
      "help_text": "Если включено, встроенные в сцену MAXScript, Python или .NET команды находятся под ограничением. Рекомендуется для продакшена; отключайте только для доверенной отладки."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "EmbeddedMAXScriptSystemCommandsExecutionBlocked": {
    "en": {
      "display_name": "Block Embedded MAXScript System Commands",
      "description": "Prevents embedded scripts from executing system-level MAXScript commands.",
      "help_text": "Enable this option to block embedded scripts from using MAXScript commands that impact OS, files or system settings. Improves security when opening external scenes."
    },
    "ru": {
      "display_name": "Блокировка системных команд MAXScript во встроенных скриптах",
      "description": "Запрещает встроенным скриптам выполнять системные команды MAXScript.",
      "help_text": "Включите эту опцию, чтобы блокировать встроенные скрипты от использования команд MAXScript, влияющих на ОС, файлы или системные настройки. Повышает безопасность при открытии внешних сцен."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "EmbeddedPythonExecutionBlocked": {
    "en": {
      "display_name": "Block Embedded Python Execution",
      "description": "Disallows execution of Python code embedded in scene files.",
      "help_text": "When set, Python scripts inside scenes will not run, reducing risk from external file imports. Enable for secure studio pipelines."
    },
    "ru": {
      "display_name": "Блокировать выполнение встроенного Python",
      "description": "Запрещает выполнение Python-кода, встроенного в файлы сцен.",
      "help_text": "При включении Python-скрипты внутри сцен не выполняются, что снижает риск при импорте внешних файлов. Включайте для безопасного студийного пайплайна."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "EmbeddedDotNetExecutionBlocked": {
    "en": {
      "display_name": "Block Embedded .NET Execution",
      "description": "Prevents .NET code execution embedded in scene scripts.",
      "help_text": "Disallow .NET API access from scene-embedded scripts to avoid external code execution. Recommended for locked-down production setups."
    },
    "ru": {
      "display_name": "Блокировать выполнение встроенного .NET",
      "description": "Запрещает выполнение .NET-кода, встроенного в скрипты сцен.",
      "help_text": "Отключите доступ встроенных скриптов к .NET API, чтобы предотвратить выполнение внешнего кода. Рекомендуется для защищённых продакшен-сред."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "SafeScriptAssetExecutionEnabled": {
    "en": {
      "display_name": "Safe Script Asset Execution",
      "description": "Enables safe handling of scripts included in asset libraries/context.",
      "help_text": "When enabled, scripts packaged in assets or external libraries are executed under restrictions to avoid malicious code propagation. Recommended for shared asset pipelines."
    },
    "ru": {
      "display_name": "Безопасное выполнение скриптов ассетов",
      "description": "Включает безопасное выполнение скриптов, включённых в библиотеки активов.",
      "help_text": "Если включено, скрипты, упакованные в ассеты или внешние библиотеки, выполняются с ограничениями, чтобы избежать распространения вредоносного кода. Рекомендуется для совместной работы с активами."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "ShowSecurityMessagesWindowOnBlockedCommandsEnabled": {
    "en": {
      "display_name": "Show Security Message on Block",
      "description": "Displays a message window when a command is blocked by the security layer.",
      "help_text": "If enabled, any blocked embedded script command triggers a pop-up window explaining the block. Useful for debugging or auditing scenes from external sources."
    },
    "ru": {
      "display_name": "Показывать окно уведомлений при блокировке",
      "description": "Отображает окно с уведомлением, когда команда блокируется слоем безопасности.",
      "help_text": "Если включено, при блокировке встроенного скрипта выводится всплывающее окно с пояснением. Полезно для отладки или аудита сцен извне."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "ShowScriptEditorOnBlockedCommandsEnabled": {
    "en": {
      "display_name": "Open Script Editor on Block",
      "description": "Automatically opens script editor when a blocked command occurs.",
      "help_text": "When activated, the script editor will open and highlight the location of the blocked command inside the embedded script. Useful for inspecting suspicious code in a scene."
    },
    "ru": {
      "display_name": "Открывать редактор скрипта при блокировке",
      "description": "Автоматически открывает редактор скриптов при блокировке команды.",
      "help_text": "Когда включено, редактор скриптов откроется и подсветит место вызова запрещённой команды. Удобно для проверки подозрительного кода в сцене."
    },
    "type": "boolean",
    "default": "",
    "recommended": "0"
  },
  "InitialHeapSize": {
    "en": {
      "display_name": "MAXScript Initial Heap Size",
      "description": "Specifies the initial memory heap size for MAXScript in megabytes.",
      "help_text": "Increase this value if you run large scripts or tool-chains in MAXScript; too large values may impact performance of garbage collection."
    },
    "ru": {
      "display_name": "Начальный размер кучи MAXScript",
      "description": "Задаёт начальный объём памяти для MAXScript в мегабайтах.",
      "help_text": "Увеличьте это значение, если используете крупные инструменты или цепочки скриптов в MAXScript; слишком большое значение может повлиять на производительность сборщика мусора."
    },
    "type": "float",
    "default": "",
    "recommended": ""
  },
  "LoadStartupScripts": {
    "en": {
      "display_name": "Load Startup Scripts",
      "description": "Determines whether MAXScript startup scripts run automatically on launch.",
      "help_text": "Enable loading of startup scripts at 3ds Max launch for custom tool-pipelines; disable to troubleshoot start-up conflicts."
    },
    "ru": {
      "display_name": "Загружать скрипты автозапуска",
      "description": "Определяет, запускаются ли скрипты автозапуска MAXScript при запуске.",
      "help_text": "Включите загрузку автоскриптов при старте 3ds Max для кастомных инструментов; отключите для устранения конфликтов при запуске."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "LoadSaveSceneScripts": {
    "en": {
      "display_name": "Run Scripts on Load/Save Scene",
      "description": "Allows MAXScript actions to execute automatically when a scene is loaded or saved.",
      "help_text": "Useful in pipelines for validation, versioning or cleanup tools; disable if you want a clean scene load/save without extra operations."
    },
    "ru": {
      "display_name": "Запуск скриптов при открытии/сохранении сцен",
      "description": "Позволяет выполнять MAXScript-действия автоматически при загрузке или сохранении сцены.",
      "help_text": "Полезно в пайплайнах для валидации, версионирования или очистки; отключите, если хотите чистую загрузку/сохранение сцены без доп. операций."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "EnableMacroRecorder": {
    "en": {
      "display_name": "Enable Macro Recorder",
      "description": "Turns on recording of user actions into MAXScript macros.",
      "help_text": "When enabled, MAXScript records your commands as macros for later reuse; disable if you do not need macro history."
    },
    "ru": {
      "display_name": "Включить запись макро",
      "description": "Включает запись действий пользователя в макросы MAXScript.",
      "help_text": "Когда включено, MAXScript сохраняет ваши команды как макросы для дальнейшего использования; отключите, если запись макро вам не нужна."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "AutoOpenListener": {
    "en": {
      "display_name": "Open MAXScript Listener on Start",
      "description": "Opens the MAXScript Listener window automatically on application start.",
      "help_text": "Useful for script developers; disable for regular production work to avoid additional UI clutter."
    },
    "ru": {
      "display_name": "Открывать Listener MAXScript при старте",
      "description": "Автоматически открывает окно Listener MAXScript при запуске приложения.",
      "help_text": "Полезно для разработчиков скриптов; отключите для обычной продакшен-работы, чтобы избежать лишнего интерфейса."
    },
    "type": "boolean",
    "default": "",
    "recommended": "0"
  },
  "DisplayScriptEditorOnError": {
    "en": {
      "display_name": "Show Script Editor on Error",
      "description": "Automatically opens the script editor when a MAXScript error occurs.",
      "help_text": "Enable this if you frequently debug scripts and want immediate access to the error location; disable during regular usage to avoid disruptions."
    },
    "ru": {
      "display_name": "Открывать редактор скриптов при ошибке",
      "description": "Автоматически открывает редактор скриптов при возникновении ошибки MAXScript.",
      "help_text": "Включите, если часто отлаживаете скрипты и хотите мгновенный доступ к месту ошибки; отключите в обычной работе, чтобы не получать лишние прерывания."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "InstalledComponents": {
    "en": {
      "display_name": "Installed Components List",
      "description": "Records modules and components currently installed in 3ds Max.",
      "help_text": "Read-only list of installed extension modules or plugins. Review for compliance or licensing; do not change manually unless instructed."
    },
    "ru": {
      "display_name": "Список установленных компонентов",
      "description": "Содержит модули и компоненты, установленные в 3ds Max.",
      "help_text": "Список только для чтения установленных расширений или плагинов. Просматривайте для соответствия или лицензирования; не изменяйте вручную без инструкции."
    },
    "type": "string",
    "default": "",
    "recommended": ""
  },
  "PluginSettings": {
    "en": {
      "display_name": "Plugin Settings",
      "description": "Defines global settings and paths for third-party plugins.",
      "help_text": "Configure plugin behaviour, load paths and version constraints here. Ensure all network users point to the same settings for consistency."
    },
    "ru": {
      "display_name": "Настройки плагинов",
      "description": "Определяет глобальные настройки и пути для сторонних плагинов.",
      "help_text": "Настройте поведение плагинов, пути загрузки и ограничения по версиям здесь. Убедитесь, что все пользователи сети используют одинаковые настройки для консистенции."
    },
    "type": "string",
    "default": "",
    "recommended": ""
  }
}
