{
  "SafeSceneScriptExecutionEnabled": {
    "en": {
      "display_name": "Safe Scene Script Execution",
      "description": "Enables sandbox mode for scripts embedded in scenes to block unsafe commands.",
      "help_text": "When enabled, embedded MAXScript, Python or .NET commands in scene files are restricted. Recommended in production environments; disable only for trusted debugging scenarios."
    },
    "ru": {
      "display_name": "Безопасное выполнение скриптов сцены",
      "description": "Включает песочницу для скриптов, встроенных в сцену, блокируя опасные команды.",
      "help_text": "Если включено, встроенные в сцену MAXScript, Python или .NET команды находятся под ограничением. Рекомендуется для продакшена; отключайте только для доверенной отладки."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "EmbeddedMAXScriptSystemCommandsExecutionBlocked": {
    "en": {
      "display_name": "Block Embedded MAXScript System Commands",
      "description": "Prevents embedded scripts from executing system-level MAXScript commands.",
      "help_text": "Enable this option to block embedded scripts from using MAXScript commands that impact OS, files or system settings. Improves security when opening external scenes."
    },
    "ru": {
      "display_name": "Блокировка системных команд MAXScript во встроенных скриптах",
      "description": "Запрещает встроенным скриптам выполнять системные команды MAXScript.",
      "help_text": "Включите эту опцию, чтобы блокировать встроенные скрипты от использования команд MAXScript, влияющих на ОС, файлы или системные настройки. Повышает безопасность при открытии внешних сцен."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "EmbeddedPythonExecutionBlocked": {
    "en": {
      "display_name": "Block Embedded Python Execution",
      "description": "Disallows execution of Python code embedded in scene files.",
      "help_text": "When set, Python scripts inside scenes will not run, reducing risk from external file imports. Enable for secure studio pipelines."
    },
    "ru": {
      "display_name": "Блокировать выполнение встроенного Python",
      "description": "Запрещает выполнение Python-кода, встроенного в файлы сцен.",
      "help_text": "При включении Python-скрипты внутри сцен не выполняются, что снижает риск при импорте внешних файлов. Включайте для безопасного студийного пайплайна."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "EmbeddedDotNetExecutionBlocked": {
    "en": {
      "display_name": "Block Embedded .NET Execution",
      "description": "Prevents .NET code execution embedded in scene scripts.",
      "help_text": "Disallow .NET API access from scene-embedded scripts to avoid external code execution. Recommended for locked-down production setups."
    },
    "ru": {
      "display_name": "Блокировать выполнение встроенного .NET",
      "description": "Запрещает выполнение .NET-кода, встроенного в скрипты сцен.",
      "help_text": "Отключите доступ встроенных скриптов к .NET API, чтобы предотвратить выполнение внешнего кода. Рекомендуется для защищённых продакшен-сред."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "SafeScriptAssetExecutionEnabled": {
    "en": {
      "display_name": "Safe Script Asset Execution",
      "description": "Enables safe handling of scripts included in asset libraries/context.",
      "help_text": "When enabled, scripts packaged in assets or external libraries are executed under restrictions to avoid malicious code propagation. Recommended for shared asset pipelines."
    },
    "ru": {
      "display_name": "Безопасное выполнение скриптов ассетов",
      "description": "Включает безопасное выполнение скриптов, включённых в библиотеки активов.",
      "help_text": "Если включено, скрипты, упакованные в ассеты или внешние библиотеки, выполняются с ограничениями, чтобы избежать распространения вредоносного кода. Рекомендуется для совместной работы с активами."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "ShowSecurityMessagesWindowOnBlockedCommandsEnabled": {
    "en": {
      "display_name": "Show Security Message on Block",
      "description": "Displays a message window when a command is blocked by the security layer.",
      "help_text": "If enabled, any blocked embedded script command triggers a pop-up window explaining the block. Useful for debugging or auditing scenes from external sources."
    },
    "ru": {
      "display_name": "Показывать окно уведомлений при блокировке",
      "description": "Отображает окно с уведомлением, когда команда блокируется слоем безопасности.",
      "help_text": "Если включено, при блокировке встроенного скрипта выводится всплывающее окно с пояснением. Полезно для отладки или аудита сцен извне."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "ShowScriptEditorOnBlockedCommandsEnabled": {
    "en": {
      "display_name": "Open Script Editor on Block",
      "description": "Automatically opens script editor when a blocked command occurs.",
      "help_text": "When activated, the script editor will open and highlight the location of the blocked command inside the embedded script. Useful for inspecting suspicious code in a scene."
    },
    "ru": {
      "display_name": "Открывать редактор скрипта при блокировке",
      "description": "Автоматически открывает редактор скриптов при блокировке команды.",
      "help_text": "Когда включено, редактор скриптов откроется и подсветит место вызова запрещённой команды. Удобно для проверки подозрительного кода в сцене."
    },
    "type": "boolean",
    "default": "",
    "recommended": "0"
  },
  "InitialHeapSize": {
    "en": {
      "display_name": "MAXScript Initial Heap Size",
      "description": "Specifies the initial memory heap size for MAXScript in megabytes.",
      "help_text": "Increase this value if you run large scripts or tool-chains in MAXScript; too large values may impact performance of garbage collection."
    },
    "ru": {
      "display_name": "Начальный размер кучи MAXScript",
      "description": "Задаёт начальный объём памяти для MAXScript в мегабайтах.",
      "help_text": "Увеличьте это значение, если используете крупные инструменты или цепочки скриптов в MAXScript; слишком большое значение может повлиять на производительность сборщика мусора."
    },
    "type": "float",
    "default": "",
    "recommended": ""
  },
  "LoadStartupScripts": {
    "en": {
      "display_name": "Load Startup Scripts",
      "description": "Determines whether MAXScript startup scripts run automatically on launch.",
      "help_text": "Enable loading of startup scripts at 3ds Max launch for custom tool-pipelines; disable to troubleshoot start-up conflicts."
    },
    "ru": {
      "display_name": "Загружать скрипты автозапуска",
      "description": "Определяет, запускаются ли скрипты автозапуска MAXScript при запуске.",
      "help_text": "Включите загрузку автоскриптов при старте 3ds Max для кастомных инструментов; отключите для устранения конфликтов при запуске."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "LoadSaveSceneScripts": {
    "en": {
      "display_name": "Run Scripts on Load/Save Scene",
      "description": "Allows MAXScript actions to execute automatically when a scene is loaded or saved.",
      "help_text": "Useful in pipelines for validation, versioning or cleanup tools; disable if you want a clean scene load/save without extra operations."
    },
    "ru": {
      "display_name": "Запуск скриптов при открытии/сохранении сцен",
      "description": "Позволяет выполнять MAXScript-действия автоматически при загрузке или сохранении сцены.",
      "help_text": "Полезно в пайплайнах для валидации, версионирования или очистки; отключите, если хотите чистую загрузку/сохранение сцены без доп. операций."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "EnableMacroRecorder": {
    "en": {
      "display_name": "Enable Macro Recorder",
      "description": "Turns on recording of user actions into MAXScript macros.",
      "help_text": "When enabled, MAXScript records your commands as macros for later reuse; disable if you do not need macro history."
    },
    "ru": {
      "display_name": "Включить запись макро",
      "description": "Включает запись действий пользователя в макросы MAXScript.",
      "help_text": "Когда включено, MAXScript сохраняет ваши команды как макросы для дальнейшего использования; отключите, если запись макро вам не нужна."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "AutoOpenListener": {
    "en": {
      "display_name": "Open MAXScript Listener on Start",
      "description": "Opens the MAXScript Listener window automatically on application start.",
      "help_text": "Useful for script developers; disable for regular production work to avoid additional UI clutter."
    },
    "ru": {
      "display_name": "Открывать Listener MAXScript при старте",
      "description": "Автоматически открывает окно Listener MAXScript при запуске приложения.",
      "help_text": "Полезно для разработчиков скриптов; отключите для обычной продакшен-работы, чтобы избежать лишнего интерфейса."
    },
    "type": "boolean",
    "default": "",
    "recommended": "0"
  },
  "DisplayScriptEditorOnError": {
    "en": {
      "display_name": "Show Script Editor on Error",
      "description": "Automatically opens the script editor when a MAXScript error occurs.",
      "help_text": "Enable this if you frequently debug scripts and want immediate access to the error location; disable during regular usage to avoid disruptions."
    },
    "ru": {
      "display_name": "Открывать редактор скриптов при ошибке",
      "description": "Автоматически открывает редактор скриптов при возникновении ошибки MAXScript.",
      "help_text": "Включите, если часто отлаживаете скрипты и хотите мгновенный доступ к месту ошибки; отключите в обычной работе, чтобы не получать лишние прерывания."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "InstalledComponents": {
    "en": {
      "display_name": "Installed Components List",
      "description": "Records modules and components currently installed in 3ds Max.",
      "help_text": "Read-only list of installed extension modules or plugins. Review for compliance or licensing; do not change manually unless instructed."
    },
    "ru": {
      "display_name": "Список установленных компонентов",
      "description": "Содержит модули и компоненты, установленные в 3ds Max.",
      "help_text": "Список только для чтения установленных расширений или плагинов. Просматривайте для соответствия или лицензирования; не изменяйте вручную без инструкции."
    },
    "type": "string",
    "default": "",
    "recommended": ""
  },
  "PluginSettings": {
    "en": {
      "display_name": "Plugin Settings",
      "description": "Defines global settings and paths for third-party plugins.",
      "help_text": "Configure plugin behaviour, load paths and version constraints here. Ensure all network users point to the same settings for consistency."
    },
    "ru": {
      "display_name": "Настройки плагинов",
      "description": "Определяет глобальные настройки и пути для сторонних плагинов.",
      "help_text": "Настройте поведение плагинов, пути загрузки и ограничения по версиям здесь. Убедитесь, что все пользователи сети используют одинаковые настройки для консистенции."
    },
    "type": "string",
    "default": "",
    "recommended": ""
  },
  "LoadSecurityTools": {
    "en": {
      "display_name": "Load Security Tools",
      "description": "Enables loading of security diagnostic tools on startup.",
      "help_text": "Loads additional security monitoring tools. Disable for production; enable only for security audits or debugging security issues."
    },
    "ru": {
      "display_name": "Загружать инструменты безопасности",
      "description": "Включает загрузку инструментов диагностики безопасности при запуске.",
      "help_text": "Загружает дополнительные инструменты мониторинга безопасности. Отключайте для продакшена; включайте только для аудита безопасности или отладки."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  },
  "DisplayUpdateNotification": {
    "en": {
      "display_name": "Display Update Notification",
      "description": "Shows notifications about available security updates.",
      "help_text": "Displays alerts when security patches or updates are available. Disable in locked-down environments; enable for dev workstations."
    },
    "ru": {
      "display_name": "Показывать уведомления об обновлениях",
      "description": "Отображает уведомления о доступных обновлениях безопасности.",
      "help_text": "Показывает оповещения при наличии патчей безопасности или обновлений. Отключайте в закрытых средах; включайте на рабочих станциях разработки."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  },
  "Performance.UnitType": {
    "en": {
      "display_name": "System Unit Type",
      "description": "Defines which unit system 3ds Max uses internally for measurements.",
      "help_text": "Sets the internal measurement system used by 3ds Max (metric, US, or custom). Changing this affects how objects scale between projects. Recommended to set once per project before modeling."
    },
    "ru": {
      "display_name": "Тип системных единиц",
      "description": "Определяет систему единиц, используемую 3ds Max для внутренних измерений.",
      "help_text": "Задаёт систему измерений, применяемую внутри 3ds Max (метрическая, дюймовая или пользовательская). Изменение влияет на масштаб объектов между проектами. Рекомендуется задавать перед началом моделирования."
    },
    "type": "integer",
    "default": "",
    "recommended": ""
  },
  "Performance.UnitScale": {
    "en": {
      "display_name": "System Unit Scale",
      "description": "Specifies the numerical scale factor for the system units.",
      "help_text": "Controls how large one system unit is relative to real-world meters. Adjust this carefully: inconsistent scaling can lead to lighting or simulation errors."
    },
    "ru": {
      "display_name": "Масштаб системной единицы",
      "description": "Определяет числовой коэффициент масштаба для системных единиц.",
      "help_text": "Контролирует, чему равна одна системная единица относительно реальных метров. Меняйте осторожно: несогласованный масштаб может вызвать ошибки освещения и симуляций."
    },
    "type": "float",
    "default": "1.0",
    "recommended": "1.0"
  },
  "Performance.UnitDispType": {
    "en": {
      "display_name": "Display Unit Type",
      "description": "Selects how units are displayed in the user interface.",
      "help_text": "Affects only the UI representation (meters, inches, feet, etc.). Does not change the internal system units."
    },
    "ru": {
      "display_name": "Тип отображаемых единиц",
      "description": "Определяет, в каких единицах отображаются значения в интерфейсе.",
      "help_text": "Влияет только на отображение в интерфейсе (метры, дюймы и т.д.), не изменяя внутренние системные единицы."
    },
    "type": "integer",
    "default": "",
    "recommended": ""
  },
  "Performance.UndoLevels": {
    "en": {
      "display_name": "Undo Levels",
      "description": "Sets the number of undo steps available in the session.",
      "help_text": "Increasing undo levels improves safety at the cost of more memory. Around 100–200 levels is ideal for most users."
    },
    "ru": {
      "display_name": "Количество уровней отмены",
      "description": "Задает число доступных шагов отмены в текущей сессии.",
      "help_text": "Увеличение количества уровней повышает безопасность работы, но потребляет больше памяти. Оптимально 100–200 уровней для большинства пользователей."
    },
    "type": "integer",
    "default": "20",
    "recommended": "200"
  },
  "Performance.RealTimePlayback": {
    "en": {
      "display_name": "Realtime Playback",
      "description": "Forces animation playback at real-time speed instead of all-frames mode.",
      "help_text": "When enabled, 3ds Max maintains target frame rate, skipping frames if necessary. Use for timing verification; disable for accurate preview of every frame."
    },
    "ru": {
      "display_name": "Проигрывание в реальном времени",
      "description": "Обеспечивает воспроизведение анимации с реальной скоростью вместо режима всех кадров.",
      "help_text": "При включении 3ds Max поддерживает целевую частоту кадров, пропуская кадры при необходимости. Используйте для проверки тайминга, отключайте для точного предпросмотра каждого кадра."
    },
    "type": "boolean",
    "default": "1",
    "recommended": "1"
  },
  "Performance.PlayActiveOnly": {
    "en": {
      "display_name": "Play Active View Only",
      "description": "Limits animation playback to the active viewport only.",
      "help_text": "Reduces GPU load by disabling simultaneous playback in multiple viewports. Recommended for complex scenes."
    },
    "ru": {
      "display_name": "Проигрывать только активное окно",
      "description": "Ограничивает воспроизведение анимации только активным окном проекции.",
      "help_text": "Снижает нагрузку на видеокарту, отключая одновременное воспроизведение в нескольких окнах. Рекомендуется для сложных сцен."
    },
    "type": "boolean",
    "default": "1",
    "recommended": "1"
  },
  "Performance.HDAOEnabled": {
    "en": {
      "display_name": "Viewport Ambient Occlusion",
      "description": "Toggles High Definition Ambient Occlusion in viewport display.",
      "help_text": "Improves realism by adding subtle shadowing in viewport shading. Disable on low-end GPUs or when editing large assemblies."
    },
    "ru": {
      "display_name": "Окклюзия окружения (HDAO)",
      "description": "Включает или выключает HDAO в отображении вьюпорта.",
      "help_text": "Повышает реализм за счёт мягких теней в окне проекции. Отключайте на слабых GPU или при работе с крупными сборками."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "Performance.AutoUnitConvert": {
    "en": {
      "display_name": "Auto Unit Conversion",
      "description": "Automatically converts imported assets to current system units.",
      "help_text": "Ensures consistent scale when importing scenes from other applications. Keep enabled to avoid mismatched object sizes."
    },
    "ru": {
      "display_name": "Автоконвертация единиц",
      "description": "Автоматически конвертирует импортируемые объекты в текущие системные единицы.",
      "help_text": "Обеспечивает согласованный масштаб при импорте сцен из других приложений. Держите включённым, чтобы избежать несоответствия размеров."
    },
    "type": "boolean",
    "default": "1",
    "recommended": "1"
  },
  "Performance.ZoomExtScaleParallel": {
    "en": {
      "display_name": "Zoom Extents Parallel Scale",
      "description": "Adjusts zoom extent factor for parallel projection viewports.",
      "help_text": "Controls how tightly the camera fits all objects in non-perspective views when using 'Zoom Extents'. A smaller value frames objects closer."
    },
    "ru": {
      "display_name": "Масштаб Zoom Extents (параллель)",
      "description": "Настраивает коэффициент масштабирования при Zoom Extents в параллельных окнах.",
      "help_text": "Определяет, насколько плотно камера охватывает все объекты в неперспективных окнах при использовании 'Zoom Extents'. Меньшее значение приближает кадр."
    },
    "type": "float",
    "default": "0.85",
    "recommended": "0.85"
  },
  "Performance.ZoomExtScalePersp": {
    "en": {
      "display_name": "Zoom Extents Perspective Scale",
      "description": "Sets zoom extent behavior for perspective viewports.",
      "help_text": "Defines camera fit distance when zooming extents in perspective views. 1.0 fits tightly; lower values leave more margin."
    },
    "ru": {
      "display_name": "Масштаб Zoom Extents (перспектива)",
      "description": "Задает поведение масштабирования для перспективных окон.",
      "help_text": "Определяет расстояние подгонки камеры при Zoom Extents в перспективных окнах. 1.0 — плотное кадрирование; меньшее значение — больший отступ."
    },
    "type": "float",
    "default": "1.0",
    "recommended": "1.0"
  },
  "Renderer.ThreadCount": {
    "en": {
      "display_name": "Render Threads",
      "description": "Controls how many CPU threads are used for rendering.",
      "help_text": "Value −1 lets 3ds Max automatically use all available cores. Set a smaller number to reserve CPU for other tasks."
    },
    "ru": {
      "display_name": "Количество потоков рендера",
      "description": "Определяет, сколько потоков CPU используется для рендеринга.",
      "help_text": "Значение −1 позволяет 3ds Max автоматически использовать все доступные ядра. Установите меньшее, если хотите оставить ресурсы для других задач."
    },
    "type": "integer",
    "default": "-1",
    "recommended": "-1"
  },
  "Renderer.DontShowMissingMapsDlg": {
    "en": {
      "display_name": "Suppress Missing Maps Dialog",
      "description": "Prevents pop-up dialog when texture maps are missing.",
      "help_text": "Enable for silent rendering on farms or automated tasks. Check log files regularly to ensure assets are valid."
    },
    "ru": {
      "display_name": "Отключить окно пропавших карт",
      "description": "Запрещает показ окна при отсутствии текстурных карт.",
      "help_text": "Включайте для тихого рендера на ферме или при автоматизации. Проверяйте логи, чтобы убедиться в наличии ассетов."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  },
  "Renderer.DontShowMissingUVWarning": {
    "en": {
      "display_name": "Suppress Missing UV Warning",
      "description": "Disables UV-mapping warning messages during render.",
      "help_text": "Use when rendering procedural assets without UVs. Disable for detailed texturing workflows."
    },
    "ru": {
      "display_name": "Отключить предупреждение об отсутствующих UV",
      "description": "Отключает предупреждения об UV-развёртке при рендере.",
      "help_text": "Используйте при рендере процедурных материалов без UV. Отключайте для проектов с ручной текстурной развёрткой."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  },
  "Renderer.FilterBackground": {
    "en": {
      "display_name": "Filter Background",
      "description": "Smooths and filters background when rendering or compositing.",
      "help_text": "Applies anti-aliasing to the background layer, reducing edge artifacts when compositing renders over transparent backgrounds. Recommended for final output rendering."
    },
    "ru": {
      "display_name": "Фильтрация фона",
      "description": "Сглаживает и фильтрует фон при рендере или композите.",
      "help_text": "Применяет сглаживание к фоновому слою, уменьшая артефакты по краям при композите рендеров с прозрачностью. Рекомендуется для финальных рендеров."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "1"
  },
  "Renderer.UseEnvironAlpha": {
    "en": {
      "display_name": "Use Environment Alpha",
      "description": "Enables transparency in environment background during rendering.",
      "help_text": "Use this to output transparent background from environment maps for compositing. Disable when using solid color backgrounds."
    },
    "ru": {
      "display_name": "Использовать альфа-канал окружения",
      "description": "Включает прозрачность в фоне окружения при рендере.",
      "help_text": "Используйте для вывода прозрачного фона из карты окружения при композите. Отключите, если используете сплошной цвет фона."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "1"
  },
  "Renderer.AlphaOutOnAdditive": {
    "en": {
      "display_name": "Alpha Output on Additive Layers",
      "description": "Defines how alpha channels are written when additive blending is used.",
      "help_text": "Controls alpha compositing of additive light passes. Set to 1 for correct blending in multi-layered compositing setups."
    },
    "ru": {
      "display_name": "Альфа при аддитивном слое",
      "description": "Определяет, как записывается альфа-канал при аддитивном смешивании.",
      "help_text": "Контролирует альфа-композитинг аддитивных световых проходов. Установите 1 для корректного смешивания в многослойных композитах."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "1"
  },
  "Renderer.OpenOnError": {
    "en": {
      "display_name": "Open Render Dialog on Error",
      "description": "Shows the Render Setup dialog automatically when a render error occurs.",
      "help_text": "Useful for debugging failed renders. Leave disabled for automated rendering pipelines to avoid interruptions."
    },
    "ru": {
      "display_name": "Открывать Render Setup при ошибке",
      "description": "Автоматически открывает окно Render Setup при ошибке рендера.",
      "help_text": "Полезно для отладки неудачных рендеров. Оставляйте выключенным для автоматических пайплайнов, чтобы избежать прерываний."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  },
  "Renderer.HDAOEnabled": {
    "en": {
      "display_name": "Render Ambient Occlusion (HDAO)",
      "description": "Applies ambient occlusion in rendered images for added realism.",
      "help_text": "Adds subtle shadowing between objects to improve perceived depth. Use with care in scenes with baked lighting or AO passes."
    },
    "ru": {
      "display_name": "Окклюзия окружения в рендере (HDAO)",
      "description": "Добавляет эффект окклюзии окружения для повышения реализма.",
      "help_text": "Добавляет мягкие тени между объектами, улучшая восприятие глубины. Используйте с осторожностью в сценах с запечённым освещением или отдельными AO-проходами."
    },
    "type": "boolean",
    "default": "1",
    "recommended": "1"
  },
  "OpenImageIO.max_open_files": {
    "en": {
      "display_name": "Max Open Files",
      "description": "Sets the maximum number of texture files OpenImageIO can keep open simultaneously.",
      "help_text": "Higher values improve performance with many small textures but increase memory consumption. Recommended between 50–200 depending on scene size."
    },
    "ru": {
      "display_name": "Максимум открытых файлов",
      "description": "Задает максимальное число файлов текстур, открытых одновременно через OpenImageIO.",
      "help_text": "Большее значение повышает производительность при множестве мелких текстур, но увеличивает потребление памяти. Рекомендуется 50–200 в зависимости от размера сцены."
    },
    "type": "integer",
    "default": "100",
    "recommended": "100"
  },
  "OpenImageIO.max_memory_MB": {
    "en": {
      "display_name": "Max Memory (MB)",
      "description": "Defines the maximum memory (in MB) OpenImageIO may use for texture caching.",
      "help_text": "Limits how much RAM OpenImageIO allocates for image caching. Set according to system memory; 4096–16384 MB works for most modern machines."
    },
    "ru": {
      "display_name": "Максимум памяти (МБ)",
      "description": "Определяет максимальный объём памяти (в МБ), используемый OpenImageIO для кэширования текстур.",
      "help_text": "Ограничивает использование оперативной памяти для кэширования изображений. Настройте по объёму вашей системы; 4096–16384 МБ подходит для большинства современных машин."
    },
    "type": "float",
    "default": "16384.0",
    "recommended": "8192.0"
  },
  "OpenImageIO.autotile": {
    "en": {
      "display_name": "Auto Tile Textures",
      "description": "Enables automatic subdivision of large textures into tiles.",
      "help_text": "Improves texture streaming performance for large bitmaps by splitting them into smaller tiles in memory. Recommended for large scenes or UDIM setups."
    },
    "ru": {
      "display_name": "Автоматическое разбиение текстур",
      "description": "Включает автоматическое деление больших текстур на тайлы.",
      "help_text": "Повышает производительность потоковой загрузки больших карт, разделяя их на более мелкие участки в памяти. Рекомендуется для больших сцен или UDIM-текстур."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "1"
  },
  "OpenImageIO.automip": {
    "en": {
      "display_name": "Auto Generate Mipmaps",
      "description": "Automatically generates mipmaps for loaded textures if missing.",
      "help_text": "Generates downscaled versions of textures for distant objects, improving performance and reducing aliasing. Recommended to keep enabled."
    },
    "ru": {
      "display_name": "Автоматическая генерация мип-карт",
      "description": "Автоматически создаёт мип-карты для загруженных текстур при их отсутствии.",
      "help_text": "Создаёт уменьшенные версии текстур для дальних объектов, повышая производительность и снижая ступенчатость. Рекомендуется держать включённым."
    },
    "type": "boolean",
    "default": "1",
    "recommended": "1"
  },
  "OpenImageIO.autoscanline": {
    "en": {
      "display_name": "Force Scanline Mode",
      "description": "Forces sequential texture reading mode for low-memory systems.",
      "help_text": "Reads texture data line-by-line instead of full caching. Use on very limited systems or for network streaming of heavy textures."
    },
    "ru": {
      "display_name": "Режим построчного чтения",
      "description": "Принудительно включает последовательное чтение текстур для систем с малым объёмом памяти.",
      "help_text": "Считывает данные текстур построчно вместо полного кэширования. Используйте на слабых системах или при потоковой загрузке тяжёлых карт по сети."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  },
  "OpenImageIO.autoFileUpdate": {
    "en": {
      "display_name": "Auto File Update",
      "description": "Automatically reloads modified texture files during session.",
      "help_text": "Detects changes in texture source files and updates them in viewport and render without manual reload. Useful for live texturing workflows."
    },
    "ru": {
      "display_name": "Автоматическое обновление файлов",
      "description": "Автоматически перезагружает изменённые файлы текстур в ходе сессии.",
      "help_text": "Отслеживает изменения исходных файлов текстур и обновляет их во вьюпорте и рендере без ручной перезагрузки. Полезно для интерактивных пайплайнов текстурирования."
    },
    "type": "boolean",
    "default": "1",
    "recommended": "1"
  },
  "MAXScript.LoadSavePersistentGlobals": {
    "en": {
      "display_name": "Persist Global Variables",
      "description": "Saves and restores global MAXScript variables between sessions.",
      "help_text": "Stores variables created in MAXScript across restarts. Useful for persistent tool data, but may cause conflicts if different scripts reuse variable names."
    },
    "ru": {
      "display_name": "Сохранять глобальные переменные",
      "description": "Сохраняет и восстанавливает глобальные переменные MAXScript между сессиями.",
      "help_text": "Сохраняет глобальные переменные MAXScript между запусками программы. Полезно для постоянных данных инструментов, но может вызывать конфликты при переиспользовании имён переменных."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  },
  "AntiAliasingQuality": {
    "en": {
      "display_name": "Anti-Aliasing Quality",
      "description": "Sets the quality level of anti-aliasing in the viewport.",
      "help_text": "Controls smoothness of geometry edges and overall visual quality in the Nitrous viewport. Higher values give smoother results but increase GPU load."
    },
    "ru": {
      "display_name": "Качество сглаживания",
      "description": "Определяет уровень качества сглаживания во вьюпорте.",
      "help_text": "Управляет плавностью краёв геометрии и общим качеством отображения во вьюпорте Nitrous. Высокие значения дают более гладкий результат, но повышают нагрузку на GPU."
    },
    "type": "integer",
    "default": "3",
    "recommended": "2"
  },
  "ViewportTextureSizeLimit": {
    "en": {
      "display_name": "Viewport Texture Size Limit",
      "description": "Defines the maximum texture resolution displayed in the viewport.",
      "help_text": "Sets the texture size cap to balance quality and performance. 2048 is optimal for most setups; reduce to 1024 for weaker GPUs."
    },
    "ru": {
      "display_name": "Лимит размера текстур во вьюпорте",
      "description": "Определяет максимальное разрешение текстур, отображаемых во вьюпорте.",
      "help_text": "Устанавливает ограничение размера текстур для баланса между качеством и производительностью. 2048 оптимально для большинства систем; уменьшайте до 1024 на слабых GPU."
    },
    "type": "integer",
    "default": "2048",
    "recommended": "2048"
  },
  "GFXTexSize": {
    "en": {
      "display_name": "Max GFX Texture Size",
      "description": "Specifies the maximum GPU texture size for Nitrous rendering.",
      "help_text": "Prevents memory overload by limiting texture resolution used by the viewport GPU renderer. Use 2048 or 4096 based on VRAM capacity."
    },
    "ru": {
      "display_name": "Макс. размер текстур GPU",
      "description": "Определяет максимальный размер текстур GPU для рендера Nitrous.",
      "help_text": "Предотвращает перегрузку памяти, ограничивая разрешение текстур, используемых рендером вьюпорта. Используйте 2048 или 4096 в зависимости от объёма VRAM."
    },
    "type": "integer",
    "default": "2048",
    "recommended": "2048"
  },
  "DisableDOFForBackground": {
    "en": {
      "display_name": "Disable DOF for Background",
      "description": "Disables depth of field for viewport background images.",
      "help_text": "Prevents background images from being blurred by viewport DOF. Recommended for scene alignment and compositing previews."
    },
    "ru": {
      "display_name": "Отключить DOF для фона",
      "description": "Отключает глубину резкости для фоновых изображений во вьюпорте.",
      "help_text": "Предотвращает размытие фоновых изображений эффектом глубины резкости. Рекомендуется при совмещении сцены и превью композита."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "1"
  },
  "SelectionHighLight": {
    "en": {
      "display_name": "Selection Highlight",
      "description": "Enables color highlighting of selected objects in the viewport.",
      "help_text": "Displays a visual highlight around selected meshes to improve clarity during modeling. Disable for complex scenes to reduce clutter."
    },
    "ru": {
      "display_name": "Подсветка выделения",
      "description": "Включает цветовую подсветку выделенных объектов во вьюпорте.",
      "help_text": "Показывает визуальное выделение вокруг выбранных объектов для удобства моделирования. Отключайте в сложных сценах для снижения визуального шума."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "1"
  },
  "SelectionOutline": {
    "en": {
      "display_name": "Selection Outline",
      "description": "Draws an outline around selected objects in the viewport.",
      "help_text": "Provides clear selection borders, especially useful for dense geometry. Combine with lower opacity for less intrusive visuals."
    },
    "ru": {
      "display_name": "Контур выделения",
      "description": "Рисует контур вокруг выделенных объектов во вьюпорте.",
      "help_text": "Обеспечивает чёткие границы выделения, особенно полезно при плотной геометрии. Используйте с низкой непрозрачностью для менее навязчивого вида."
    },
    "type": "boolean",
    "default": "1",
    "recommended": "1"
  },
  "PreviewHighLight": {
    "en": {
      "display_name": "Hover Highlight",
      "description": "Highlights objects under cursor hover.",
      "help_text": "Temporarily highlights geometry when the cursor hovers over it. Helps quick selection but may reduce viewport performance on large scenes."
    },
    "ru": {
      "display_name": "Подсветка при наведении",
      "description": "Подсвечивает объекты при наведении курсора.",
      "help_text": "Временно подсвечивает геометрию под курсором. Упрощает выбор объектов, но может снижать производительность в больших сценах."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  },
  "OutlineThickness": {
    "en": {
      "display_name": "Outline Thickness",
      "description": "Sets thickness for selection outlines.",
      "help_text": "Controls how bold selection borders appear in viewport. Adjust for readability depending on monitor DPI or color scheme."
    },
    "ru": {
      "display_name": "Толщина контура",
      "description": "Задаёт толщину контура выделения.",
      "help_text": "Определяет, насколько жирным будет контур выделения во вьюпорте. Подберите для удобства чтения в зависимости от DPI или темы интерфейса."
    },
    "type": "float",
    "default": "1.0",
    "recommended": "1.0"
  },
  "OutlineOpacity": {
    "en": {
      "display_name": "Outline Opacity",
      "description": "Sets transparency level of selection outlines.",
      "help_text": "Lower values make outlines subtler; higher values emphasize selection. Adjust for scene complexity or personal preference."
    },
    "ru": {
      "display_name": "Прозрачность контура",
      "description": "Определяет уровень прозрачности контура выделения.",
      "help_text": "Меньшие значения делают контур менее заметным; большие — подчёркивают выделение. Настраивайте под сложность сцены или предпочтения."
    },
    "type": "float",
    "default": "1.0",
    "recommended": ""
  },
  "CommandPanel.RollupBreakThreshold": {
    "en": {
      "display_name": "Panel Rollup Threshold",
      "description": "Defines when rollups collapse automatically in command panel.",
      "help_text": "Sets height threshold for collapsing panels to save space. Increase to keep more rollouts expanded simultaneously."
    },
    "ru": {
      "display_name": "Порог сворачивания панелей",
      "description": "Определяет, когда сворачивать вкладки командной панели автоматически.",
      "help_text": "Задаёт высоту, при которой вкладки сворачиваются для экономии места. Увеличьте, чтобы больше вкладок оставались раскрытыми одновременно."
    },
    "type": "integer",
    "default": "50",
    "recommended": ""
  },
  "Modstack.Visible": {
    "en": {
      "display_name": "Show Modifier Stack",
      "description": "Toggles visibility of modifier stack panel.",
      "help_text": "Disabling hides the modifier stack to maximize workspace. Useful on small monitors or for presentation mode."
    },
    "ru": {
      "display_name": "Показывать стек модификаторов",
      "description": "Переключает отображение панели стека модификаторов.",
      "help_text": "Отключение скрывает стек модификаторов для увеличения рабочего пространства. Удобно на маленьких мониторах или при показе модели."
    },
    "type": "boolean",
    "default": "1",
    "recommended": "1"
  },
  "LayerManger.DuplicateLayerWithoutSameHierarchy": {
    "en": {
      "display_name": "Duplicate Layer Flat",
      "description": "Determines if duplicated layers retain parent hierarchy.",
      "help_text": "When enabled, duplicated layers are created at the root instead of preserving original layer nesting. Simplifies organization in complex scenes."
    },
    "ru": {
      "display_name": "Дублировать слой без иерархии",
      "description": "Определяет, сохраняет ли дубликат слоя иерархию родителя.",
      "help_text": "Если включено, дублированные слои создаются на верхнем уровне без сохранения иерархии. Упрощает организацию в сложных сценах."
    },
    "type": "boolean",
    "default": "1",
    "recommended": "1"
  },
  "ObjectSnapSettings.DisplaySnapMarkers": {
    "en": {
      "display_name": "Show Snap Markers",
      "description": "Displays visual markers at snap points in viewport.",
      "help_text": "Shows cross markers when snapping to vertices or edges. Helps precision modeling; disable for performance on heavy geometry."
    },
    "ru": {
      "display_name": "Показывать маркеры привязки",
      "description": "Отображает визуальные маркеры точек привязки во вьюпорте.",
      "help_text": "Показывает крестики при привязке к вершинам или рёбрам. Повышает точность моделирования; отключайте для производительности на тяжёлой геометрии."
    },
    "type": "boolean",
    "default": "1",
    "recommended": "1"
  },
  "ObjectSnapSettings.SnapMarkerSize": {
    "en": {
      "display_name": "Snap Marker Size",
      "description": "Sets pixel size of snap markers on screen.",
      "help_text": "Controls marker size visibility based on screen resolution. Larger values help with 4K monitors."
    },
    "ru": {
      "display_name": "Размер маркеров привязки",
      "description": "Задаёт размер маркеров привязки в пикселях.",
      "help_text": "Управляет видимостью маркеров в зависимости от разрешения экрана. Большие значения удобны на 4K-мониторах."
    },
    "type": "integer",
    "default": "20",
    "recommended": ""
  },
  "ObjectSnapSettings.SnapRadius": {
    "en": {
      "display_name": "Snap Radius",
      "description": "Defines the radius around cursor for snap detection.",
      "help_text": "Increasing radius makes snapping easier but less precise. Adjust for your workflow or tablet precision."
    },
    "ru": {
      "display_name": "Радиус привязки",
      "description": "Определяет радиус вокруг курсора для обнаружения привязки.",
      "help_text": "Увеличение радиуса упрощает привязку, но снижает точность. Настраивайте под свой стиль работы или планшет."
    },
    "type": "integer",
    "default": "20",
    "recommended": "20"
  },
  "ObjectSnapSettings.DisplayRubberBand": {
    "en": {
      "display_name": "Show Rubber Band Line",
      "description": "Displays connecting line when using snaps.",
      "help_text": "Provides visual feedback while snapping objects. Disable if it interferes with precise alignment."
    },
    "ru": {
      "display_name": "Показывать линию привязки",
      "description": "Отображает соединительную линию при использовании привязок.",
      "help_text": "Даёт визуальную обратную связь во время привязки объектов. Отключите, если мешает точному совмещению."
    },
    "type": "boolean",
    "default": "1",
    "recommended": "1"
  },
  "ObjectSnapSettings.SnapType": {
    "en": {
      "display_name": "Snap Type",
      "description": "Selects snap mode (2D, 3D, or combined).",
      "help_text": "Choose 2 for 3D snapping in modeling. Use 3 for hybrid snapping to both planar and spatial elements."
    },
    "ru": {
      "display_name": "Тип привязки",
      "description": "Выбирает режим привязки (2D, 3D или комбинированный).",
      "help_text": "Выберите 2 для 3D-привязки при моделировании. Используйте 3 для гибридного режима к плоскостям и пространственным элементам."
    },
    "type": "integer",
    "default": "3",
    "recommended": "3"
  },
  "InstallPath": {
    "en": {
      "display_name": "Install Path",
      "description": "Specifies the absolute folder where 3ds Max is installed on this machine.",
      "help_text": "Use this read-only path to locate core binaries and default resources. Do not change manually; use the official installer or deployment tools to relocate or repair the installation."
    },
    "ru": {
      "display_name": "Путь установки",
      "description": "Указывает абсолютную папку, где установлен 3ds Max на этом компьютере.",
      "help_text": "Используйте путь только для чтения, чтобы находить основные бинарники и ресурсы. Не изменяйте вручную; для переноса или восстановления используйте официальный установщик или средства развёртывания."
    },
    "type": "path",
    "default": "C:\\Program Files\\Autodesk\\3ds Max 2025\\",
    "recommended": ""
  },
  "ProjectFolder": {
    "en": {
      "display_name": "Project Folder",
      "description": "Sets the default project directory used when creating or opening scenes.",
      "help_text": "Point this to your current project root to standardize relative paths for scenes, assets, renders and backups. Prefer fast local SSD or version-controlled workspace for reliability and speed."
    },
    "ru": {
      "display_name": "Папка проекта",
      "description": "Устанавливает папку проекта по умолчанию при создании или открытии сцен.",
      "help_text": "Направьте на корень текущего проекта, чтобы стандартизировать относительные пути для сцен, ассетов, рендеров и бэкапов. Предпочтительны быстрый локальный SSD или рабочее пространство под VCS для надёжности и скорости."
    },
    "type": "path",
    "default": "C:\\Users\\acherednikov\\Documents\\3ds Max 2025",
    "recommended": ""
  },
  "Scenes": {
    "en": {
      "display_name": "Scenes Folder",
      "description": "Defines the relative or absolute path where scene files are stored.",
      "help_text": "Keep this inside the project to preserve portability and consistent relative references. Relative form like .\\scenes is recommended for moving projects between machines."
    },
    "ru": {
      "display_name": "Папка сцен",
      "description": "Определяет относительный или абсолютный путь хранения файлов сцен.",
      "help_text": "Держите внутри проекта для переносимости и единых относительных ссылок. Рекомендуется относительный вариант .\\scenes при переносе проектов между машинами."
    },
    "type": "path",
    "default": ".\\scenes",
    "recommended": ".\\scenes"
  },
  "Import": {
    "en": {
      "display_name": "Import Folder",
      "description": "Specifies the default directory for imported files and references.",
      "help_text": "Use a dedicated import folder to keep stage files separate from clean scene data. Helps organize source vs processed assets during pipeline work."
    },
    "ru": {
      "display_name": "Папка импорта",
      "description": "Определяет папку по умолчанию для импортируемых файлов и ссылок.",
      "help_text": "Используйте отдельную папку импорта, чтобы отделить исходники от чистых данных сцены. Это упорядочивает исходные и обработанные ассеты в пайплайне."
    },
    "type": "path",
    "default": ".\\import",
    "recommended": ".\\import"
  },
  "Export": {
    "en": {
      "display_name": "Export Folder",
      "description": "Specifies the directory where exported files are written.",
      "help_text": "Keep exports isolated from source scenes to avoid clutter and accidental overwrites. Consider subfolders per target DCC, engine or department."
    },
    "ru": {
      "display_name": "Папка экспорта",
      "description": "Определяет каталог, куда записываются экспортируемые файлы.",
      "help_text": "Держите экспорт отдельно от исходных сцен, чтобы избежать мусора и случайных перезаписей. Используйте подпапки по целевому DCC, движку или отделу."
    },
    "type": "path",
    "default": ".\\export",
    "recommended": ".\\export"
  },
  "RenderOutput": {
    "en": {
      "display_name": "Render Output",
      "description": "Sets the default output directory for rendered frames and sequences.",
      "help_text": "Place on a fast local or network volume with ample space. For farms, point to a shared UNC path accessible from all render nodes to avoid broken outputs."
    },
    "ru": {
      "display_name": "Папка рендер-вывода",
      "description": "Устанавливает папку по умолчанию для рендер-кадров и секвенций.",
      "help_text": "Размещайте на быстром локальном или сетевом хранилище с запасом места. Для ферм используйте общий UNC-путь, доступный всем нодам, чтобы избежать битых результатов."
    },
    "type": "path",
    "default": ".\\renderoutput",
    "recommended": ""
  },
  "AutoBackup": {
    "en": {
      "display_name": "Autobackup Folder",
      "description": "Defines where automatic backup .max files are stored for the project.",
      "help_text": "Use a local SSD for speed, then sync or archive to a server. Keep it inside project to remain portable; ensure space for the configured backup count."
    },
    "ru": {
      "display_name": "Папка автосохранений",
      "description": "Определяет место хранения автоматических резервных .max файлов проекта.",
      "help_text": "Для скорости используйте локальный SSD, затем синхронизируйте или архивируйте на сервер. Держите в проекте для переносимости; следите за достаточным местом под настроенное число бэкапов."
    },
    "type": "path",
    "default": ".\\autoback",
    "recommended": ""
  },
  "Scripts": {
    "en": {
      "display_name": "Scripts Folder",
      "description": "Points to the global scripts directory shipped with 3ds Max.",
      "help_text": "Contains stock scripts and tools; avoid editing here. Place custom tools in user script folders to simplify updates and avoid permission issues."
    },
    "ru": {
      "display_name": "Папка скриптов",
      "description": "Указывает на глобальный каталог скриптов, поставляемый с 3ds Max.",
      "help_text": "Содержит штатные скрипты и инструменты; не редактируйте здесь. Пользовательские инструменты храните в пользовательских папках скриптов для упрощения обновлений и прав доступа."
    },
    "type": "path",
    "default": "C:\\Program Files\\Autodesk\\3ds Max 2025\\scripts",
    "recommended": ""
  },
  "Startup Scripts": {
    "en": {
      "display_name": "Startup Scripts",
      "description": "Directory scanned for scripts executed automatically on startup.",
      "help_text": "Use for vetted, trusted scripts that configure your environment. Keep minimal to reduce startup time and potential conflicts between tools."
    },
    "ru": {
      "display_name": "Скрипты автозапуска",
      "description": "Каталог, откуда автоматически выполняются скрипты при старте.",
      "help_text": "Используйте для проверенных скриптов, настраивающих окружение. Держите список минимальным, чтобы не увеличивать время старта и избегать конфликтов."
    },
    "type": "path",
    "default": "C:\\Program Files\\Autodesk\\3ds Max 2025\\scripts\\startup",
    "recommended": ""
  },
  "Additional Scripts": {
    "en": {
      "display_name": "Additional Scripts",
      "description": "User-level folder for storing custom scripts and tools.",
      "help_text": "Point to a version-controlled workspace (Git/SVN) or shared pipeline path. Keeps custom tools decoupled from program files and eases deployment."
    },
    "ru": {
      "display_name": "Дополнительные скрипты",
      "description": "Пользовательская папка для хранения кастомных скриптов и инструментов.",
      "help_text": "Укажите на рабочее пространство под VCS (Git/SVN) или общий путь пайплайна. Это отделяет инструменты от файлов программы и упрощает развёртывание."
    },
    "type": "path",
    "default": "C:\\Users\\acherednikov\\AppData\\Local\\Autodesk\\3dsMax\\2025 - 64bit\\ENU\\scripts",
    "recommended": ""
  },
  "Additional Startup Scripts": {
    "en": {
      "display_name": "Additional Startup Scripts",
      "description": "Extra user startup scripts executed on application launch.",
      "help_text": "Use for user-specific bootstraps and team presets. Keep under source control and review regularly to avoid legacy leftovers affecting new projects."
    },
    "ru": {
      "display_name": "Доп. скрипты автозапуска",
      "description": "Дополнительные пользовательские скрипты, выполняемые при запуске приложения.",
      "help_text": "Храните пользовательские бутстрапы и пресеты команды. Держите под системой контроля версий и регулярно ревизуйте, чтобы старые остатки не влияли на новые проекты."
    },
    "type": "path",
    "default": "C:\\Users\\acherednikov\\AppData\\Local\\Autodesk\\3dsMax\\2025 - 64bit\\ENU\\scripts\\startup",
    "recommended": ""
  },
  "Additional Macros": {
    "en": {
      "display_name": "User Macros",
      "description": "Folder for user macro scripts (.mcr) used in menus and hotkeys.",
      "help_text": "Place custom macros here to keep them separate from system content. Combine with a shared repo to standardize tools across the team."
    },
    "ru": {
      "display_name": "Пользовательские макросы",
      "description": "Папка пользовательских макроскриптов (.mcr) для меню и хоткеев.",
      "help_text": "Размещайте свои макросы здесь, отделяя от системного контента. Используйте общий репозиторий для стандартизации инструментов в команде."
    },
    "type": "path",
    "default": "C:\\Users\\acherednikov\\AppData\\Local\\Autodesk\\3dsMax\\2025 - 64bit\\ENU\\usermacros",
    "recommended": ""
  },
  "Mode": {
    "en": {
      "display_name": "Normal Bump Mode",
      "description": "Selects the normal map interpretation mode used by the Normal Bump shader.",
      "help_text": "Use the 3ds Max mode for native tangent basis. Switch only if matching a specific engine or toolchain that expects a different tangent-space convention."
    },
    "ru": {
      "display_name": "Режим Normal Bump",
      "description": "Выбирает способ интерпретации нормал-карт шейдером Normal Bump.",
      "help_text": "Используйте режим 3ds Max для нативной тангент-базы. Меняйте только при необходимости совпасть с движком или пайплайном, ожидающим иную конвенцию tangent-space."
    },
    "type": "string",
    "default": "3dsMax",
    "recommended": "3dsMax"
  },
  "CalculateBitangentPerPixel": {
    "en": {
      "display_name": "Per-Pixel Bitangent",
      "description": "Computes bitangent per pixel for more accurate normal mapping.",
      "help_text": "Improves shading fidelity at the cost of performance. Keep enabled for high-quality previews; disable on low-end GPUs or heavy scenes to save milliseconds."
    },
    "ru": {
      "display_name": "Би-тангент на пиксель",
      "description": "Вычисляет би-тангент на пиксель для более точного normal-mapping.",
      "help_text": "Повышает точность шейдинга ценой производительности. Держите включённым для качественных превью; отключайте на слабых GPU или тяжёлых сценах ради экономии времени."
    },
    "type": "boolean",
    "default": "1",
    "recommended": "1"
  },
  "3DMapScale_Meters": {
    "en": {
      "display_name": "3D Map Scale (m)",
      "description": "Sets default 3D procedural map scale in meters for material editor previews.",
      "help_text": "Controls the perceived size of 3D noise and procedural textures in previews. Match this to your common real-world scale to maintain look consistency across materials."
    },
    "ru": {
      "display_name": "Масштаб 3D-карт (м)",
      "description": "Задаёт масштаб 3D процедурных карт в метрах для предпросмотра материалов.",
      "help_text": "Управляет видимым размером 3D-шумов и процедурных текстур в предпросмотрах. Подгоняйте под типичный реальный масштаб, чтобы сохранять единый вид материалов."
    },
    "type": "float",
    "default": "3.0",
    "recommended": ""
  },
  "3DMapScale_Inches": {
    "en": {
      "display_name": "3D Map Scale (in)",
      "description": "Sets default 3D procedural map scale in inches for material editor previews.",
      "help_text": "Use when working in US units. Keep proportional with the metric setting to avoid mismatched scale when switching display units."
    },
    "ru": {
      "display_name": "Масштаб 3D-карт (дюймы)",
      "description": "Задаёт масштаб 3D процедурных карт в дюймах для предпросмотра материалов.",
      "help_text": "Используйте при работе в американских единицах. Сохраняйте пропорциональность с метрической настройкой, чтобы при смене единиц не нарушать масштаб."
    },
    "type": "float",
    "default": "100.0",
    "recommended": ""
  },
  "DefaultTextureSize_Meters": {
    "en": {
      "display_name": "Default Texture Size (m)",
      "description": "Defines default size for 2D textures in meters in material previews.",
      "help_text": "Affects UV tiling perception in the editor. Set to common physical scale of your surfaces to make previews representative of in-scene appearance."
    },
    "ru": {
      "display_name": "Размер текстуры по умолчанию (м)",
      "description": "Определяет стандартный размер 2D текстур в метрах в предпросмотрах материалов.",
      "help_text": "Влияет на восприятие тайлинга UV в редакторе. Установите под типичный физический размер ваших поверхностей, чтобы превью соответствовали виду в сцене."
    },
    "type": "float",
    "default": "1.0",
    "recommended": ""
  },
  "DefaultTextureSize_Inches": {
    "en": {
      "display_name": "Default Texture Size (in)",
      "description": "Defines default size for 2D textures in inches in material previews.",
      "help_text": "Use for US unit workflows. Keep consistent with metric default to avoid visual jumps when unit display changes."
    },
    "ru": {
      "display_name": "Размер текстуры по умолчанию (дюймы)",
      "description": "Определяет стандартный размер 2D текстур в дюймах в предпросмотрах материалов.",
      "help_text": "Используйте в рабочих процессах с американскими единицами. Держите согласованным с метрическим значением, чтобы избежать визуальных скачков при смене единиц."
    },
    "type": "float",
    "default": "48.0",
    "recommended": ""
  },
  "AmbientColor": {
    "en": {
      "display_name": "Default Ambient Color",
      "description": "Sets the default ambient color used by the material editor.",
      "help_text": "Usually kept black to avoid unintended brightening in previews. Change only for specific look-dev needs; real-time viewports rely on scene lighting instead."
    },
    "ru": {
      "display_name": "Цвет окружения по умолчанию",
      "description": "Устанавливает цвет окружения по умолчанию в редакторе материалов.",
      "help_text": "Обычно оставляют чёрным, чтобы избежать непреднамеренного осветления предпросмотров. Меняйте только под конкретные задачи look-dev; во вьюпортах используется освещение сцены."
    },
    "type": "array",
    "default": [
      0.0,
      0.0,
      0.0
    ],
    "recommended": [
      0.0,
      0.0,
      0.0
    ]
  },
  "DefaultMaterialViewportMode": {
    "en": {
      "display_name": "Material Viewport Mode",
      "description": "Chooses the default shading mode for materials displayed in viewport.",
      "help_text": "Value 1 typically corresponds to a modern shaded/realistic preview. Use realistic for PBR look-dev; switch to shaded on very large scenes to save performance."
    },
    "ru": {
      "display_name": "Режим материалов во вьюпорте",
      "description": "Выбирает режим затенения по умолчанию для материалов во вьюпорте.",
      "help_text": "Значение 1 обычно соответствует современному затенённому/реалистичному предпросмотру. Для PBR лучше реалистичный; на очень больших сценах переключайтесь на упрощённый для экономии ресурсов."
    },
    "type": "integer",
    "default": "1",
    "recommended": "1"
  },
  "AutoBackupEnabled": {
    "en": {
      "display_name": "Enable Autobackup",
      "description": "Turns automatic backup of scene files on or off during work.",
      "help_text": "Strongly recommended to keep enabled. Protects against crashes and mistakes. Tune interval and file count for scene complexity and disk speed."
    },
    "ru": {
      "display_name": "Включить автосохранение",
      "description": "Включает или выключает автоматическое резервное сохранение сцен во время работы.",
      "help_text": "Настоятельно рекомендуется держать включённым. Защищает от сбоев и ошибок. Подберите интервал и число файлов под сложность сцен и скорость диска."
    },
    "type": "boolean",
    "default": "1",
    "recommended": "1"
  },
  "AutoBackupInterval": {
    "en": {
      "display_name": "Autobackup Interval",
      "description": "Sets the number of minutes between automatic backups.",
      "help_text": "15 minutes is a sensible default. Lower to 5–10 for risky operations; raise for heavy scenes to avoid interruptions during long edits."
    },
    "ru": {
      "display_name": "Интервал автосохранения",
      "description": "Задаёт количество минут между автоматическими сохранениями.",
      "help_text": "15 минут — разумный дефолт. Уменьшайте до 5–10 при рискованных операциях; увеличивайте для тяжёлых сцен, чтобы не мешать длительным правкам."
    },
    "type": "float",
    "default": "15.0",
    "recommended": "15.0"
  },
  "AutoBackupNumFiles": {
    "en": {
      "display_name": "Autobackup Count",
      "description": "Specifies how many backup files are kept before older ones are overwritten.",
      "help_text": "Ten backups suit most projects. Increase for critical jobs or long sessions; ensure sufficient disk space in the autoback folder."
    },
    "ru": {
      "display_name": "Количество автосохранений",
      "description": "Определяет, сколько резервных файлов хранится до перезаписи старых.",
      "help_text": "Десяти хватает для большинства проектов. Увеличивайте для критичных задач или длинных сессий; обеспечьте достаточное место в папке автосохранений."
    },
    "type": "integer",
    "default": "10",
    "recommended": "10"
  },
  "AutoBackupCompressOnAutoBackup": {
    "en": {
      "display_name": "Compress Backups",
      "description": "Enables compression for autobackup files to save disk space.",
      "help_text": "Reduces storage usage at the cost of slightly longer save times. Keep disabled on very large scenes if save stalls become noticeable."
    },
    "ru": {
      "display_name": "Сжимать бэкапы",
      "description": "Включает сжатие файлов автосохранений для экономии места.",
      "help_text": "Снижает использование диска ценой немного более долгого сохранения. Держите выключенным на очень больших сценах, если заметны подвисания при сохранении."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  },
  "AutoBackupPrependSceneName": {
    "en": {
      "display_name": "Prefix Scene Name",
      "description": "Adds the scene name to backup filenames for clarity across projects.",
      "help_text": "Useful when juggling multiple scenes or branches. Makes it easier to identify which backups belong to which file during recovery."
    },
    "ru": {
      "display_name": "Добавлять имя сцены",
      "description": "Добавляет имя сцены к именам файлов автосохранений для удобства.",
      "help_text": "Полезно при работе с несколькими сценами или ветками. Проще идентифицировать, какие бэкапы относятся к какому файлу при восстановлении."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  },
  "AutoBackupBailoutEnabled": {
    "en": {
      "display_name": "Graceful Abort",
      "description": "Cancels an autobackup if user is in the middle of an interactive operation.",
      "help_text": "Prevents disruptive saves when transforming, simulating or editing heavily. Keep enabled to minimize interruptions during intensive tasks."
    },
    "ru": {
      "display_name": "Мягкая отмена",
      "description": "Отменяет автосохранение, если пользователь в процессе интерактивной операции.",
      "help_text": "Предотвращает мешающие сохранения во время трансформаций, симуляций или тяжёлых правок. Держите включённым, чтобы минимизировать прерывания при интенсивной работе."
    },
    "type": "boolean",
    "default": "1",
    "recommended": "1"
  },
  "AutoBackupFinalCountdownInterval": {
    "en": {
      "display_name": "Countdown Seconds",
      "description": "Sets the warning countdown before an autobackup starts.",
      "help_text": "Short countdown allows you to finish a click-drag or cancel saving if it is about to interrupt a critical step. Increase slightly if you often miss the warning."
    },
    "ru": {
      "display_name": "Отсчёт (секунды)",
      "description": "Задаёт предупреждающий отсчёт перед началом автосохранения.",
      "help_text": "Короткий отсчёт даёт завершить перетаскивание или отменить сохранение, если оно мешает важному шагу. Увеличьте немного, если часто не успеваете отреагировать."
    },
    "type": "float",
    "default": "0.333333",
    "recommended": "0.33"
  },
  "AutoBackupShowCountdown": {
    "en": {
      "display_name": "Show Countdown",
      "description": "Displays a visible countdown before an autobackup executes.",
      "help_text": "Keeps you informed about imminent saves and lets you pause workflow briefly. Recommended enabled to avoid surprise pauses in the middle of edits."
    },
    "ru": {
      "display_name": "Показывать отсчёт",
      "description": "Отображает видимый отсчёт перед выполнением автосохранения.",
      "help_text": "Информирует о скором сохранении и позволяет на секунду приостановить работу. Рекомендуется включать, чтобы избегать неожиданных пауз в ходе правок."
    },
    "type": "boolean",
    "default": "1",
    "recommended": "1"
  },
  "AutoBackupFileName": {
    "en": {
      "display_name": "Backup Base Name",
      "description": "Sets the base filename used for autobackup files.",
      "help_text": "Choose a clear, searchable prefix to quickly identify backups. Combine with scene-name prefix for maximum clarity in shared projects."
    },
    "ru": {
      "display_name": "Базовое имя бэкапа",
      "description": "Задаёт базовое имя, используемое для файлов автосохранений.",
      "help_text": "Выберите понятный, легко находимый префикс для быстрой идентификации бэкапов. Совмещайте с добавлением имени сцены для максимальной ясности в общих проектах."
    },
    "type": "string",
    "default": "AutoBackup",
    "recommended": "AutoBackup"
  },
  "StandardMtlFBXImport": {
    "en": {
      "display_name": "FBX Import as Standard Material",
      "description": "Forces FBX importer to use legacy Standard material type.",
      "help_text": "Enable to ensure FBX files import with classic Standard materials. Useful for older renderers or compatibility with pre-2017 scenes."
    },
    "ru": {
      "display_name": "Импорт FBX как Standard Material",
      "description": "Принудительно импортирует FBX-материалы как старые Standard-материалы.",
      "help_text": "Включите для корректного импорта в старых пайплайнах (Scanline, V-Ray 2 / 3). Для PBR лучше оставить выключенным."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  },
  "EnableExtendedMenus": {
    "en": {
      "display_name": "Enable Extended Menus",
      "description": "Re-enables classic menu entries hidden in newer UI versions.",
      "help_text": "Restores deprecated tools like File Link Manager and Asset Tracking. Toggle on if legacy scripts reference those menu commands."
    },
    "ru": {
      "display_name": "Расширенные меню",
      "description": "Включает старые пункты меню, скрытые в новых версиях интерфейса.",
      "help_text": "Возвращает устаревшие инструменты (File Link Manager, Asset Tracking). Полезно, если старые скрипты ссылаются на эти команды."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "LegacyMaterialEditor": {
    "en": {
      "display_name": "Use Compact Material Editor",
      "description": "Brings back the classic Compact Material Editor interface.",
      "help_text": "Set to 1 to switch from Slate to the old Compact Material Editor. Faster for light scenes or script automation; lacks modern node features."
    },
    "ru": {
      "display_name": "Классический редактор материалов",
      "description": "Возвращает старый компактный редактор материалов.",
      "help_text": "Установите 1, чтобы переключиться со Slate на старый редактор. Быстрее при лёгких сценах или скриптовой автоматизации, но без узловых возможностей."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  },
  "UseOldGamma": {
    "en": {
      "display_name": "Use Legacy Gamma",
      "description": "Applies legacy gamma/linear workflow behavior.",
      "help_text": "Preserves exact brightness from pre-2020 scenes when loading archived work. Use only if re-rendering historical projects that relied on older gamma curve."
    },
    "ru": {
      "display_name": "Старое поведение гаммы",
      "description": "Применяет устаревшую логику работы гаммы и линейного режима.",
      "help_text": "Сохраняет прежнюю яркость сцен до 2020 года при повторном рендере. Используйте только для исторических проектов, зависимых от старой кривой гаммы."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  },
  "DisableSceneExplorer": {
    "en": {
      "display_name": "Disable Scene Explorer",
      "description": "Prevents Scene Explorer window from initializing on startup.",
      "help_text": "Speeds up launch on low-RAM systems or stripped-down render nodes. Recommended only if you never use Scene Explorer for management."
    },
    "ru": {
      "display_name": "Отключить Scene Explorer",
      "description": "Запрещает инициализацию Scene Explorer при запуске.",
      "help_text": "Ускоряет запуск на системах с малым объёмом ОЗУ или на рендер-нодах без интерфейса. Рекомендуется только если Scene Explorer не используется."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  },
  "AllowLegacyLighting": {
    "en": {
      "display_name": "Allow Legacy Lighting",
      "description": "Restores pre-Nitrous viewport lighting calculation.",
      "help_text": "Helps match old renders where Nitrous shading differs from classic. Enable only for look-matching legacy assets."
    },
    "ru": {
      "display_name": "Разрешить старое освещение",
      "description": "Восстанавливает старую схему освещения до Nitrous.",
      "help_text": "Помогает добиться совпадения рендера, если Nitrous отображает свет иначе. Включайте только для совместимости со старыми ассетами."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  },
  "DisableViewportD3DCache": {
    "en": {
      "display_name": "Clear D3D Cache on Start",
      "description": "Forces 3ds Max to rebuild its Direct3D viewport cache each launch.",
      "help_text": "Use when switching GPUs or after driver updates to avoid shader glitches. Slows first start slightly but refreshes all compiled shaders safely."
    },
    "ru": {
      "display_name": "Очистка кеша D3D при запуске",
      "description": "Принуждает 3ds Max пересоздавать кеш Direct3D при каждом запуске.",
      "help_text": "Используйте при смене GPU или обновлении драйверов, чтобы избежать артефактов шейдеров. Немного замедляет первый запуск, но полностью обновляет кеш."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "1"
  },
  "SilentMode": {
    "en": {
      "display_name": "Silent Mode",
      "description": "Suppresses all message boxes and user prompts.",
      "help_text": "Ideal for unattended batch rendering or automation. Combine with log output redirection to track issues without user interaction."
    },
    "ru": {
      "display_name": "Тихий режим",
      "description": "Подавляет все диалоговые окна и запросы пользователю.",
      "help_text": "Идеально для безнадзорного пакетного рендеринга или автоматизации. Совмещайте с перенаправлением логов, чтобы отслеживать ошибки без участия пользователя."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "1"
  },
  "AutoPurgeUndo": {
    "en": {
      "display_name": "Auto Purge Undo",
      "description": "Automatically clears the undo buffer after save or render.",
      "help_text": "Frees RAM on long sessions; disables undo history after operation. Enable on render nodes or memory-critical workstations."
    },
    "ru": {
      "display_name": "Автоочистка Undo",
      "description": "Автоматически очищает историю Undo после сохранения или рендера.",
      "help_text": "Освобождает память при длительных сессиях; после операции отмена будет недоступна. Включайте на рендер-нодах или системах с ограниченной RAM."
    },
    "type": "boolean",
    "default": "0",
    "recommended": "0"
  },
  "Font": {
    "en": {
      "display_name": "Editor Font",
      "description": "Sets the font family used by the MAXScript editor and listener.",
      "help_text": "Choose a monospaced font for best code readability (e.g., Consolas, Fira Code). Changing the font affects only the script editor UI and does not impact scene performance."
    },
    "ru": {
      "display_name": "Шрифт редактора",
      "description": "Задаёт гарнитуру шрифта для редактора MAXScript и Listener.",
      "help_text": "Выбирайте моноширинный шрифт для лучшей читаемости кода (например, Consolas, Fira Code). Изменение шрифта влияет только на интерфейс редактора и не влияет на производительность сцены."
    },
    "type": "string",
    "default": "",
    "recommended": ""
  },
  "FontSize": {
    "en": {
      "display_name": "Editor Font Size",
      "description": "Specifies the point size of the MAXScript editor font.",
      "help_text": "Increase for high-DPI displays or presentation; reduce to fit more lines on screen. Extremely large sizes may reduce editor performance on very long files."
    },
    "ru": {
      "display_name": "Размер шрифта редактора",
      "description": "Определяет кегль шрифта в редакторе MAXScript.",
      "help_text": "Увеличивайте для высоких DPI или презентаций; уменьшайте, чтобы поместить больше строк на экран. Чрезмерно большие размеры могут замедлить редактор на очень длинных файлах."
    },
    "type": "integer",
    "default": "",
    "recommended": ""
  },
  "ShowCommandPanelSwitch": {
    "en": {
      "display_name": "Echo Panel Switch",
      "description": "Shows messages when command panel tabs are switched via macros.",
      "help_text": "Useful during tool development to understand which panel commands are triggered. Disable in production to keep the listener uncluttered."
    },
    "ru": {
      "display_name": "Эхо переключений панели",
      "description": "Показывает сообщения при переключении вкладок командной панели макросами.",
      "help_text": "Полезно при разработке инструментов, чтобы видеть, какие команды панели вызываются. В продакшене отключайте, чтобы не засорять Listener."
    },
    "type": "boolean",
    "default": "",
    "recommended": "0"
  },
  "ShowToolSelections": {
    "en": {
      "display_name": "Echo Tool Selections",
      "description": "Prints messages when tool modes or subtools are selected.",
      "help_text": "Helps track tool changes while recording macros or debugging. Turn off to reduce console noise during normal work."
    },
    "ru": {
      "display_name": "Эхо выбора инструментов",
      "description": "Выводит сообщения при выборе режимов инструментов или подинструментов.",
      "help_text": "Помогает отслеживать смену инструментов при записи макросов или отладке. Выключайте, чтобы уменьшить шум в консоли при обычной работе."
    },
    "type": "boolean",
    "default": "",
    "recommended": "0"
  },
  "ShowMenuSelections": {
    "en": {
      "display_name": "Echo Menu Selections",
      "description": "Logs menu command selections to the listener window.",
      "help_text": "Useful to discover the macro names behind menu items. Disable outside of debugging to avoid excessive logging."
    },
    "ru": {
      "display_name": "Эхо выбора меню",
      "description": "Записывает выбранные команды меню в окно Listener.",
      "help_text": "Полезно, чтобы видеть названия макрокоманд за пунктами меню. Отключайте вне отладки, чтобы избежать лишних логов."
    },
    "type": "boolean",
    "default": "",
    "recommended": "0"
  },
  "AbsoluteSceneNames": {
    "en": {
      "display_name": "Absolute Scene Names",
      "description": "Controls whether file operations display absolute scene paths.",
      "help_text": "Enable for unambiguous path outputs in scripts and logs; disable to keep project-relative paths for portability across machines."
    },
    "ru": {
      "display_name": "Абсолютные имена сцен",
      "description": "Определяет, показывать ли абсолютные пути сцен в операциях.",
      "help_text": "Включайте для однозначных путей в скриптах и логах; отключайте, чтобы сохранять относительные пути проекта для переносимости между машинами."
    },
    "type": "boolean",
    "default": "",
    "recommended": ""
  },
  "AbsoluteSubObjects": {
    "en": {
      "display_name": "Absolute Sub-Objects",
      "description": "Shows sub-object references as absolute identifiers in outputs.",
      "help_text": "Improves clarity in debugging outputs and batch logs, especially for complex hierarchies. Keep off to reduce verbosity in everyday work."
    },
    "ru": {
      "display_name": "Абсолютные подобъекты",
      "description": "Показывает ссылки на подобъекты как абсолютные идентификаторы в выводе.",
      "help_text": "Улучшает читаемость отладочного вывода и логов, особенно при сложных иерархиях. Держите выключенным, чтобы уменьшить многословность в повседневной работе."
    },
    "type": "boolean",
    "default": "",
    "recommended": "0"
  },
  "AbsoluteTransforms": {
    "en": {
      "display_name": "Absolute Transforms",
      "description": "Outputs transformation values in absolute world space where applicable.",
      "help_text": "Enable to standardize transform readouts for pipelines that require world-space numbers. Disable when working primarily in local/object space."
    },
    "ru": {
      "display_name": "Абсолютные трансформации",
      "description": "Выводит значения трансформаций в абсолютном мировом пространстве, где применимо.",
      "help_text": "Включайте для унификации вывода трансформаций в пайплайнах, требующих мировые значения. Отключите при работе в основном в локальном пространстве объекта."
    },
    "type": "boolean",
    "default": "",
    "recommended": "0"
  },
  "UseFastNodeNameLookup": {
    "en": {
      "display_name": "Fast Node Lookup",
      "description": "Enables faster internal lookup for node names in scripts.",
      "help_text": "Improves performance of scripts that frequently resolve nodes by name. Safe to keep enabled; disable only for diagnosing rare naming conflicts."
    },
    "ru": {
      "display_name": "Быстрый поиск узлов",
      "description": "Включает ускоренный внутренний поиск имён узлов в скриптах.",
      "help_text": "Ускоряет работу скриптов, часто ищущих узлы по имени. Безопасно держать включённым; отключайте только для диагностики редких конфликтов имён."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "ShowGCStatus": {
    "en": {
      "display_name": "Show GC Status",
      "description": "Displays information about MAXScript garbage collection events.",
      "help_text": "Useful when optimizing memory allocations in tools. Disable to keep the console clean during non-development sessions."
    },
    "ru": {
      "display_name": "Показывать статус GC",
      "description": "Показывает информацию о событиях сборщика мусора MAXScript.",
      "help_text": "Полезно при оптимизации выделений памяти в инструментах. Отключайте, чтобы консоль оставалась чистой в обычных сессиях."
    },
    "type": "boolean",
    "default": "",
    "recommended": "0"
  },
  "ShowEditorPath": {
    "en": {
      "display_name": "Show Editor Path",
      "description": "Shows full file path in the MAXScript editor window title.",
      "help_text": "Enable to avoid confusion with similarly named scripts stored in different folders. Recommended for team environments using shared repositories."
    },
    "ru": {
      "display_name": "Путь в заголовке редактора",
      "description": "Показывает полный путь файла в заголовке окна редактора MAXScript.",
      "help_text": "Включайте, чтобы не путать одноимённые скрипты из разных папок. Рекомендуется в командной работе с общими репозиториями."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "PrevalidateResourceValues": {
    "en": {
      "display_name": "Prevalidate Resources",
      "description": "Checks resource values before script execution where applicable.",
      "help_text": "Reduces runtime errors by validating required paths and parameters ahead of time. Slightly increases startup cost of tools that use it."
    },
    "ru": {
      "display_name": "Предпроверка ресурсов",
      "description": "Проверяет значения ресурсов до выполнения скриптов, где применимо.",
      "help_text": "Снижает риск ошибок во время выполнения, заранее валидируя пути и параметры. Незначительно увеличивает время запуска инструментов, которые это используют."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "MinimalColumnWidth": {
    "en": {
      "display_name": "Minimal Column Width",
      "description": "Sets the minimal width for command panel columns.",
      "help_text": "Increase on high-DPI displays to prevent control truncation. Lower to fit more UI in narrow layouts or small screens."
    },
    "ru": {
      "display_name": "Мин. ширина колонки",
      "description": "Задаёт минимальную ширину колонок командной панели.",
      "help_text": "Увеличивайте на мониторах с высоким DPI, чтобы не обрезались элементы. Уменьшайте, чтобы влезало больше интерфейса на узких макетах или маленьких экранах."
    },
    "type": "integer",
    "default": "",
    "recommended": ""
  },
  "ResolveUNCPathsForMappedDrives": {
    "en": {
      "display_name": "Resolve UNC for Mapped",
      "description": "Resolves mapped drive letters to UNC paths for consistency.",
      "help_text": "Use in mixed environments to avoid letter conflicts across machines. Ensures texture and cache paths stay valid on render nodes."
    },
    "ru": {
      "display_name": "Разрешать UNC для дисков",
      "description": "Преобразует сетевые диски в UNC-пути для согласованности.",
      "help_text": "Полезно в смешанных средах, чтобы избежать конфликтов букв дисков. Гарантирует корректность путей текстур и кэша на рендер-нодах."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "ResolveToRelative": {
    "en": {
      "display_name": "Resolve To Relative",
      "description": "Converts absolute project paths to relative ones where possible.",
      "help_text": "Keeps scenes portable between workstations and CI nodes. Recommended when the project folder is shared or version-controlled."
    },
    "ru": {
      "display_name": "Преобразовывать в относительные",
      "description": "Преобразует абсолютные пути проекта в относительные, где возможно.",
      "help_text": "Сохраняет переносимость сцен между рабочими станциями и CI-нодами. Рекомендуется при общих или версионируемых папках проекта."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "Enabled": {
    "en": {
      "display_name": "Selection Enabled",
      "description": "Toggles selection highlighting features in the viewport.",
      "help_text": "Disable all selection highlights for maximum performance in massive scenes. Keep enabled during modeling for visual clarity."
    },
    "ru": {
      "display_name": "Подсветка включена",
      "description": "Переключает функции подсветки выделения во вьюпорте.",
      "help_text": "Отключайте всю подсветку для максимальной производительности в огромных сценах. Держите включённой при моделировании для наглядности."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "Animation": {
    "en": {
      "display_name": "Selection Animation",
      "description": "Animates selection changes with short transitions.",
      "help_text": "Smoother selection can feel responsive but adds tiny overhead. Disable to shave milliseconds when navigating dense geometry."
    },
    "ru": {
      "display_name": "Анимация выделения",
      "description": "Анимирует смену выделения короткими переходами.",
      "help_text": "Плавность делает интерфейс отзывчивее, но даёт небольшой оверхед. Отключайте, чтобы сэкономить миллисекунды на плотной геометрии."
    },
    "type": "boolean",
    "default": "",
    "recommended": "0"
  },
  "UseSceneDepth": {
    "en": {
      "display_name": "Use Scene Depth",
      "description": "Calculates selection highlight with scene depth for better readability.",
      "help_text": "Depth-aware outlines help disambiguate overlapping meshes. Slight performance hit on older GPUs; consider disabling for speed."
    },
    "ru": {
      "display_name": "Использовать глубину сцены",
      "description": "Рассчитывает подсветку выделения с учётом глубины сцены для лучшей читаемости.",
      "help_text": "Контуры с учётом глубины помогают различать пересекающиеся меши. Немного снижает производительность на старых GPU; отключайте ради скорости."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "DefaultValuesSkipped": {
    "en": {
      "display_name": "Skip Defaults",
      "description": "Skips writing default Nitrous values to config to reduce clutter.",
      "help_text": "Keeps INI files compact by not storing values equal to defaults. Enable in managed environments; disable if you need explicit full configs."
    },
    "ru": {
      "display_name": "Пропускать значения по умолчанию",
      "description": "Пропускает запись стандартных значений Nitrous в конфиг для упрощения.",
      "help_text": "Держит INI-файлы компактными, не сохраняя значения, равные умолчаниям. Включайте в управляемых средах; отключайте, если нужны явные полные конфиги."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "ViewportBackgroundTextureSizeLimit": {
    "en": {
      "display_name": "Background Texture Limit",
      "description": "Caps the maximum resolution of background images in viewport.",
      "help_text": "Reduce on low-VRAM GPUs to prevent stutters when panning with high-res plates. Increase when doing precise match-move and need sharp references."
    },
    "ru": {
      "display_name": "Лимит фоновой текстуры",
      "description": "Ограничивает максимальное разрешение фоновых изображений во вьюпорте.",
      "help_text": "Уменьшайте на видеокартах с малой VRAM, чтобы избежать фризов при панорамировании с высокими референсами. Увеличивайте для точного match-move."
    },
    "type": "integer",
    "default": "",
    "recommended": "2048"
  },
  "R25Shadows": {
    "en": {
      "display_name": "R25 Shadows",
      "description": "Enables renderer shadow algorithm variant labeled R25.",
      "help_text": "Toggle to match legacy projects expecting the R25 shadow behavior. Keep off for modern defaults unless visual parity is required."
    },
    "ru": {
      "display_name": "Тени R25",
      "description": "Включает вариант алгоритма теней рендера с пометкой R25.",
      "help_text": "Включайте для совпадения со старыми проектами, ожидающими поведение теней R25. Держите выключенным для современных умолчаний, если не требуется совпадение вида."
    },
    "type": "boolean",
    "default": "",
    "recommended": "0"
  },
  "ScanBandHeight": {
    "en": {
      "display_name": "Scan Band Height",
      "description": "Sets band height for scanline rendering passes, in pixels.",
      "help_text": "Lower values reduce peak memory but add overhead due to more bands. Increase on powerful systems for slightly faster scanline rendering."
    },
    "ru": {
      "display_name": "Высота полос сканлайна",
      "description": "Задаёт высоту полос при сканлайн-рендеринге, в пикселях.",
      "help_text": "Меньшие значения снижают пиковую память, но увеличивают накладные расходы из-за большего числа полос. Увеличивайте на мощных системах для небольшого ускорения."
    },
    "type": "integer",
    "default": "",
    "recommended": ""
  },
  "ZoomExtentsOnIsolate": {
    "en": {
      "display_name": "Zoom On Isolate",
      "description": "Automatically performs Zoom Extents when isolating selection.",
      "help_text": "Speeds up focus on isolated objects and improves navigation. Disable if you often isolate while keeping current framing."
    },
    "ru": {
      "display_name": "Зум при изоляции",
      "description": "Автоматически выполняет Zoom Extents при изоляции выделения.",
      "help_text": "Ускоряет фокусировку на изолированных объектах и улучшает навигацию. Отключайте, если часто изолируете, сохраняя текущее кадрирование."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "SaveUIonExit": {
    "en": {
      "display_name": "Save UI On Exit",
      "description": "Saves window layouts and UI state when closing 3ds Max.",
      "help_text": "Enable to persist custom layouts between sessions. Disable on shared machines or render nodes to keep a consistent default layout."
    },
    "ru": {
      "display_name": "Сохранять UI при выходе",
      "description": "Сохраняет раскладки окон и состояние интерфейса при закрытии 3ds Max.",
      "help_text": "Включайте, чтобы сохранять пользовательские раскладки между сессиями. Отключайте на общих компьютерах или рендер-нодах для единого дефолтного интерфейса."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "UseAxisConstraints": {
    "en": {
      "display_name": "Use Axis Constraints",
      "description": "Applies axis constraints to snapping operations where relevant.",
      "help_text": "Maintains consistent snap behavior with transform axis locks. Disable for freeform snapping during concept modeling."
    },
    "ru": {
      "display_name": "Ограничения осей",
      "description": "Применяет осевые ограничения к операциям привязки, где это уместно.",
      "help_text": "Сохраняет согласованное поведение привязки с блокировками осей трансформации. Отключайте для свободной привязки в концепт-моделинге."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "SnapToFrozen": {
    "en": {
      "display_name": "Snap To Frozen",
      "description": "Allows snapping to objects that are frozen in the scene.",
      "help_text": "Useful for precise layout while keeping reference geometry locked. Disable if frozen objects interfere with selection."
    },
    "ru": {
      "display_name": "Привязка к замороженным",
      "description": "Разрешает привязку к объектам, замороженным в сцене.",
      "help_text": "Полезно для точной раскладки при заблокированной референс-геометрии. Отключайте, если замороженные объекты мешают выбору."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "SnapPreviewRadius": {
    "en": {
      "display_name": "Snap Preview Radius",
      "description": "Sets the preview radius for snap detection in pixels.",
      "help_text": "Larger radius makes snap targets easier to acquire but can feel imprecise. Tune for tablet vs mouse workflows."
    },
    "ru": {
      "display_name": "Радиус превью привязки",
      "description": "Задаёт радиус предварительного просмотра привязки в пикселях.",
      "help_text": "Больший радиус упрощает захват точек, но снижает точность. Подбирайте под стиль работы с планшетом или мышью."
    },
    "type": "integer",
    "default": "",
    "recommended": "20"
  },
  "UnitDispUSFraction": {
    "en": {
      "display_name": "US Fraction Display",
      "description": "Displays US units as architectural fractions instead of decimals.",
      "help_text": "Enable for feet-inch workflows (e.g., 1'-3 1/2\"). Disable to show decimal inches. Does not change internal system units."
    },
    "ru": {
      "display_name": "Доли в US единицах",
      "description": "Показывает американские единицы как архитектурные дроби вместо десятичных.",
      "help_text": "Включайте для футов-дюймов (например, 1'-3 1/2\"). Отключайте для десятичных дюймов. Не меняет внутренние системные единицы."
    },
    "type": "boolean",
    "default": "",
    "recommended": ""
  },
  "UnitDispMetricType": {
    "en": {
      "display_name": "Metric Display Type",
      "description": "Selects metric display style (meters, centimeters, millimeters).",
      "help_text": "Purely affects UI display of units, not the internal system scale. Choose the unit that matches your reference specs."
    },
    "ru": {
      "display_name": "Тип метрического отображения",
      "description": "Выбирает стиль отображения метрических единиц (метры, сантиметры, миллиметры).",
      "help_text": "Влияет только на отображение единиц в интерфейсе, а не на внутренний масштаб системы. Выбирайте единицу, соответствующую вашим референсам."
    },
    "type": "integer",
    "default": "",
    "recommended": ""
  },
  "UnitDispCustomName": {
    "en": {
      "display_name": "Custom Unit Name",
      "description": "Defines the name shown for a custom display unit.",
      "help_text": "Use with custom unit scale to label outputs meaningfully (e.g., ‘tiles’ or ‘studs’). Ensure team members share the same definition."
    },
    "ru": {
      "display_name": "Имя пользовательской единицы",
      "description": "Определяет имя, отображаемое для пользовательской единицы.",
      "help_text": "Используйте вместе с пользовательским масштабом, чтобы осмысленно подписать вывод (например, «плитки» или «стадии»). Убедитесь, что команда использует ту же дефиницию."
    },
    "type": "string",
    "default": "",
    "recommended": ""
  },
  "UnitDispCustomValue": {
    "en": {
      "display_name": "Custom Unit Value",
      "description": "Sets the numeric scale factor for a custom display unit.",
      "help_text": "Determines how a custom unit maps to system units. Document the ratio in your pipeline to avoid misinterpretation of dimensions."
    },
    "ru": {
      "display_name": "Значение пользовательской единицы",
      "description": "Задаёт числовой коэффициент масштаба для пользовательской единицы.",
      "help_text": "Определяет соответствие пользовательской единицы системным единицам. Задокументируйте коэффициент в пайплайне, чтобы избежать путаницы в размерах."
    },
    "type": "float",
    "default": "",
    "recommended": ""
  },
  "UnitDispCustomUnit": {
    "en": {
      "display_name": "Custom Unit Suffix",
      "description": "Specifies the suffix label displayed after custom unit values.",
      "help_text": "Keep short and unambiguous (e.g., ‘tu’). Align across tools and exporters to maintain consistent readouts in documentation."
    },
    "ru": {
      "display_name": "Суффикс пользовательской единицы",
      "description": "Определяет суффикс, отображаемый после значений пользовательской единицы.",
      "help_text": "Делайте коротким и однозначным (например, «tu»). Согласуйте между инструментами и экспортёрами для единообразия в документации."
    },
    "type": "string",
    "default": "",
    "recommended": ""
  },
  "LightingSystem": {
    "en": {
      "display_name": "Lighting System",
      "description": "Selects the default scene lighting system preset.",
      "help_text": "Choose a preset that matches your render pipeline (e.g., Photometric). Changing after look-dev may alter perceived brightness."
    },
    "ru": {
      "display_name": "Система освещения",
      "description": "Выбирает пресет системы освещения сцены по умолчанию.",
      "help_text": "Выберите пресет, соответствующий вашему пайплайну рендера (например, Фотометрический). Изменение после look-dev может изменить воспринимаемую яркость."
    },
    "type": "integer",
    "default": "",
    "recommended": ""
  },
  "TransformGizmoRestoreAxis": {
    "en": {
      "display_name": "Restore Gizmo Axis",
      "description": "Restores previous transform axis mode when exiting certain tools.",
      "help_text": "Keeps axis behavior predictable while switching frequently between modeling tools. Disable if you prefer tools to set their own axis mode."
    },
    "ru": {
      "display_name": "Восстанавливать ось гизма",
      "description": "Восстанавливает предыдущий режим осей трансформации при выходе из инструментов.",
      "help_text": "Сохраняет предсказуемость поведения осей при частом переключении инструментов. Отключайте, если предпочитаете, чтобы инструменты задавали свой режим осей."
    },
    "type": "boolean",
    "default": "",
    "recommended": "1"
  },
  "CurrentHotkeyDir": {
    "en": {
      "display_name": "Hotkey Directory",
      "description": "Path where custom hotkey files are loaded from.",
      "help_text": "Point to a shared or version-controlled folder to standardize shortcuts across the team. Ensure all users have read access."
    },
    "ru": {
      "display_name": "Папка хоткеев",
      "description": "Путь, откуда загружаются файлы пользовательских хоткеев.",
      "help_text": "Укажите на общую или версионируемую папку для стандартизации горячих клавиш в команде. Убедитесь, что у всех есть доступ на чтение."
    },
    "type": "path",
    "default": "",
    "recommended": ""
  },
  "CurrentHotkeyFile": {
    "en": {
      "display_name": "Hotkey File",
      "description": "Filename of the active hotkey configuration.",
      "help_text": "Use .hsx extension. Keep backups when experimenting with custom shortcuts to avoid losing working setups."
    },
    "ru": {
      "display_name": "Файл хоткеев",
      "description": "Имя файла активной конфигурации хоткеев.",
      "help_text": "Используйте расширение .hsx. Делайте бэкапы при экспериментах с горячими клавишами, чтобы не потерять рабочие настройки."
    },
    "type": "string",
    "default": "",
    "recommended": ""
  },
  "LoadedWorkspace": {
    "en": {
      "display_name": "Loaded Workspace",
      "description": "Name of the currently active UI workspace.",
      "help_text": "Switch between workspaces to quickly reorganize panels for different tasks (modeling, rigging, animation). Define custom workspaces via Customize UI."
    },
    "ru": {
      "display_name": "Активная раскладка",
      "description": "Имя текущей активной раскладки интерфейса.",
      "help_text": "Переключайте раскладки для быстрой перестройки панелей под разные задачи (моделирование, риггинг, анимация). Создавайте свои через Customize UI."
    },
    "type": "string",
    "default": "",
    "recommended": ""
  },
  "CurrentMenuDir": {
    "en": {
      "display_name": "Menu Directory",
      "description": "Directory containing main menu configuration files.",
      "help_text": "Usually points to UI_LN/CUI in the 3ds Max install folder. Avoid changing unless deploying custom menus studio-wide."
    },
    "ru": {
      "display_name": "Папка меню",
      "description": "Каталог, содержащий файлы конфигурации главного меню.",
      "help_text": "Обычно указывает на UI_LN/CUI в папке установки 3ds Max. Не меняйте, если не разворачиваете кастомные меню для всей студии."
    },
    "type": "path",
    "default": "",
    "recommended": ""
  },
  "CurrentMenuFile": {
    "en": {
      "display_name": "Menu File",
      "description": "Filename of the active menu configuration (.mnx).",
      "help_text": "Switch to a custom .mnx for alternative menu layouts. Backup the default before overwriting to restore stock settings if needed."
    },
    "ru": {
      "display_name": "Файл меню",
      "description": "Имя файла активной конфигурации меню (.mnx).",
      "help_text": "Переключайте на кастомный .mnx для альтернативных раскладок меню. Сделайте бэкап дефолтного перед заменой, чтобы вернуть стандартные настройки."
    },
    "type": "string",
    "default": "",
    "recommended": ""
  },
  "CurrentQuadMenuDir": {
    "en": {
      "display_name": "Quad Menu Directory",
      "description": "Directory for quad menu configuration files.",
      "help_text": "Stores .qmnx files defining right-click context menus. Keep in shared repo for team consistency."
    },
    "ru": {
      "display_name": "Папка квад-меню",
      "description": "Каталог файлов конфигурации квад-меню (правый клик).",
      "help_text": "Хранит .qmnx файлы, определяющие контекстные меню. Держите в общем репозитории для единообразия команды."
    },
    "type": "path",
    "default": "",
    "recommended": ""
  },
  "CurrentQuadMenuFile": {
    "en": {
      "display_name": "Quad Menu File",
      "description": "Active quad menu configuration file (.qmnx).",
      "help_text": "Customize right-click menus for faster access to frequent commands. Version control these files to share team workflows."
    },
    "ru": {
      "display_name": "Файл квад-меню",
      "description": "Активный файл конфигурации квад-меню (.qmnx).",
      "help_text": "Настраивайте меню правого клика для быстрого доступа к частым командам. Версионируйте эти файлы, чтобы делиться рабочими процессами команды."
    },
    "type": "string",
    "default": "",
    "recommended": ""
  },
  "MouseFileName": {
    "en": {
      "display_name": "Mouse Config File",
      "description": "File defining mouse button and gesture behavior (.musx).",
      "help_text": "Customize for tablet or 3D mouse workflows. Ensure team members use compatible setups if sharing scene references that assume specific interactions."
    },
    "ru": {
      "display_name": "Файл конфигурации мыши",
      "description": "Файл, определяющий поведение кнопок мыши и жестов (.musx).",
      "help_text": "Настраивайте под планшет или 3D-мышь. Убедитесь, что у команды совместимые настройки при общих референсах, зависимых от определённых взаимодействий."
    },
    "type": "path",
    "default": "",
    "recommended": ""
  },
  "ColorFileName": {
    "en": {
      "display_name": "Color Scheme File",
      "description": "UI color scheme configuration file (.clrx).",
      "help_text": "Switch to a custom .clrx for personalized UI colors or studio branding. Export and share to maintain consistent visual identity."
    },
    "ru": {
      "display_name": "Файл цветовой схемы",
      "description": "Файл конфигурации цветовой схемы интерфейса (.clrx).",
      "help_text": "Переключайте на кастомный .clrx для персонализированных цветов UI или брендинга студии. Экспортируйте и делитесь для единой визуальной идентичности."
    },
    "type": "path",
    "default": "",
    "recommended": ""
  }
}